zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t DEBUGEN    : 4;            /*!< [3..0] Debug Enable                                                       */
            uint32_t            : 28;
    } DEBUG_b;
  } ;
} APBDMA_Type;                                  /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                          AUDADC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Audio Analog Digital Converter Control (AUDADC)
  */

typedef struct {                                /*!< (@ 0x40210000) AUDADC Structure                                           */

  union {
    __IOM uint32_t CFG;                         /*!< (@ 0x00000000) The Audio ADC Configuration Register contains
                                                                    the software control for selecting the clock
                                                                    frequency used for the SAR conversions,
                                                                    the trigger polarity, the trigger select,
                                                                    the reference voltage select, the low power
                                                                    mode, the operating mode (single scan per
                                                                    trigger vs. repeating mode) and AUDADC enable.             */

    struct {
      __IOM uint32_t ADCEN      : 1;            /*!< [0..0] This bit enables the AUDADC module. While the AUDADC
                                                     is enabled, the ADCCFG and SLOT Configuration regsiter
                                                     settings must remain stable and unchanged. All configuration
                                                     register settings, slot configuration settings and window
                                                     comparison settings should be written prior to setting
                                                     the ADCEN bit to '1'.                                                     */
            uint32_t            : 1;
      __IOM uint32_t RPTEN      : 1;            /*!< [2..2] This bit enables Repeating Scan Mode.                              */
      __IOM uint32_t LPMODE     : 1;            /*!< [3..3] Select power mode to enter between active scans.                   */
      __IOM uint32_t CKMODE     : 1;            /*!< [4..4] Clock mode register                                                */
            uint32_t            : 7;
      __IOM uint32_t DFIFORDEN  : 1;            /*!< [12..12] Destructive FIFO Read Enable. Setting this will enable
                                                     FIFO pop upon reading the FIFOPR register.                                */
      __IOM uint32_t SAMPMODE   : 1;            /*!< [13..13] Audio ADC sampling mode. Changes to this control bit
                                                     are applied when the audio ADC is not performing conversions.
                                                     This is the only control bit which is properly synchronized
                                                     to AUDADC operation.                                                      */
            uint32_t            : 2;
      __IOM uint32_t TRIGSEL    : 3;            /*!< [18..16] Select the AUDADC trigger source.                                */
      __IOM uint32_t TRIGPOL    : 1;            /*!< [19..19] This bit selects the AUDADC trigger polarity for external
                                                     off chip triggers.                                                        */
      __IOM uint32_t RPTTRIGSEL : 1;            /*!< [20..20] This bit selects which periodic trigger to use with
                                                     RPTEN = 1.                                                                */
            uint32_t            : 3;
      __IOM uint32_t CLKSEL     : 2;            /*!< [25..24] Select the source and frequency for the AUDADC clock.This
                                                     field should be left as is because HFRC_48MHz is the only
                                                     clock selection and it is selected by default. All values
                                                     enumerated below as 'RSVD' are undefined. The AUDADC controller
                                                     automatically shuts off the clock in its low power modes.
                                                     When setting ADCEN to '0', CLKSEL should remain set to
                                                     0x0 or 0x1 for proper power down sequencing.                              */
            uint32_t            : 6;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< (@ 0x00000004) This register indicates the basic power status
                                                                    for the AUDADC. For detailed power status,
                                                                    see the power control power status register.
                                                                    AUDADC power mode 0 indicates the AUDADC
                                                                    is in its full power state and is ready
                                                                    to process scans. AUDADC Power mode 1 indicates
                                                                    the AUDADC enabled and in a low power state.               */

    struct {
      __IOM uint32_t PWDSTAT    : 1;            /*!< [0..0] Indicates the power-status of the AUDADC.                          */
            uint32_t            : 31;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t SWT;                         /*!< (@ 0x00000008) This register enables initiating an AUDADC scan
                                                                    through software.                                          */

