zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t FIFOCNT    : 8;            /*!< [7..0] Number of valid entries in the AUDADC FIFO.                        */
            uint32_t            : 24;
    } FIFOSTAT_b;
  } ;

  union {
    __IOM uint32_t DATAOFFSET;                  /*!< (@ 0x00000048) ERROR: reg_brief VALUE MISSING                             */

    struct {
      __IOM uint32_t OFFSET     : 13;           /*!< [12..0] Add this signed offset to data before being written
                                                     to the FIFO. This enables the user to convert unsigned
                                                     samples to signed or remove a DC offset on the samples.
                                                     Note that this does NOT affect the comparator limits, which
                                                     still operate on original unsigned samples.                               */
            uint32_t            : 19;
    } DATAOFFSET_b;
  } ;
  __IM  uint32_t  RESERVED[5];

  union {
    __IOM uint32_t ZXCFG;                       /*!< (@ 0x00000060) Zero Crossing Comparator Configuration                     */

    struct {
      __IOM uint32_t ZXEN       : 1;            /*!< [0..0] Enable the ZX comparator                                           */
            uint32_t            : 3;
      __IOM uint32_t ZXCHANSEL  : 1;            /*!< [4..4] Select which slots to use for zero crossing measurement.
                                                     0 enables zero crossing detection on slots 0 and 2. 1 enables
                                                     zero crossing detection on slots 1 and 3.                                 */
            uint32_t            : 27;
    } ZXCFG_b;
  } ;

  union {
    __IOM uint32_t ZXLIM;                       /*!< (@ 0x00000064) Zero Crossing Comparator Limits                            */

    struct {
      __IOM uint32_t LZXC       : 12;           /*!< [11..0] Sets the lower integer sample limit for the ZX comparator.
                                                     Note that these values are raw AUDADC values whose bounds
                                                     are specified by PRMODE but not maniupulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value. Samples must enter the range between
                                                     UZXC and LZXC in order for a zero crossing to be recognized.              */
            uint32_t            : 4;
      __IOM uint32_t UZXC       : 12;           /*!< [27..16] Sets the upper integer sample limit for the ZX comparator.
                                                     Note that these values are raw AUDADC values whose bounds
                                                     are specified by PRMODE but not maniupulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value. Samples must enter the range between
                                                     UZXC and LZXC in order for a zero crossing to be recognized.              */
            uint32_t            : 4;
    } ZXLIM_b;
  } ;

  union {
    __IOM uint32_t GAINCFG;                     /*!< (@ 0x00000068) PGA Gain Configuration                                     */

    struct {
      __IOM uint32_t PGACTRLEN  : 1;            /*!< [0..0] Enable PGA gain updates.                                           */
            uint32_t            : 3;
      __IOM uint32_t UPDATEMODE : 1;            /*!< [4..4] PGA update mode                                                    */
            uint32_t            : 27;
    } GAINCFG_b;
  } ;

  union {
    __IOM uint32_t GAIN;                        /*!< (@ 0x0000006C) PGA Gain Codes                                             */

    struct {
      __IOM uint32_t LGA        : 7;            /*!< [6..0] Specifies the low gain code (0 to 60 decimal specifies
                                                     -6.0 dB to 24.0 dB in half-dB increments) for channel A
                                                     (slot 0).                                                                 */
            uint32_t            : 1;
      __IOM uint32_t HGADELTA   : 7;            /*!< [14..8] Specifies the high gain code (0 to 60 decimal specifies
                                                     0 dB to 30.0 dB in half-dB increments) as the delta from
                                                     the LGA field for channel A (slot 1). Note that HGADELTA
                                                     must be LE (24 - LGA) dB.                                                 */
            uint32_t            : 1;
      __IOM uint32_t LGB        : 7;            /*!< [22..16] Specifies the low gain code (0 to 60 decimal specifies
                                                     -6.0 dB to 24.0 dB in half-dB increments) for channel B
                                                     (slot 2).                                                                 */
            uint32_t            : 1;
      __IOM uint32_t HGBDELTA   : 7;            /*!< [30..24] Specifies the high gain code (0 to 60 decimal specifies
                                                     0 dB to 30.0 dB in half-dB increments) as the delta from
                                                     the LGB field for channel B (slot 3). Note that HGBDELTA
                                                     must be LE (24 - LGB) dB.                                                 */
            uint32_t            : 1;
    } GAIN_b;
  } ;
  __IM  uint32_t  RESERVED1[13];

  union {
    __IOM uint32_t SATCFG;                      /*!< (@ 0x000000A4) Saturation Comparator Configuration                        */

