zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t CLMDTSC4TSC6 : 1;          /*!< [0..0] Indicates that the TSc4/TSc6 propietary color format
                                                     is enabled                                                                */
      __IOM uint32_t CLMDTLYUV420 : 1;          /*!< [1..1] Indicates that the TLYUV420 color format is enabled                */
      __IOM uint32_t CLMDVYUV420 : 1;           /*!< [2..2] Indicates that the V_YUV420 color format is enabled                */
      __IOM uint32_t CLMDBGRA8888 : 1;          /*!< [3..3] Indicates that the BGRA8888 32-bit color format is enabled         */
      __IOM uint32_t CLMDABGR8888 : 1;          /*!< [4..4] Indicates that the ABGR8888 32-bit color format is enabled         */
      __IOM uint32_t CLMDYUY2   : 1;            /*!< [5..5] Indicates that the YUY2 color format is enabled                    */
      __IOM uint32_t CLMDRGB888 : 1;            /*!< [6..6] Indicates that the RGB888 24-bit color format is enabled           */
      __IOM uint32_t CLMDYUYV   : 1;            /*!< [7..7] Indicates that the YUYV color format is enabled                    */
      __IOM uint32_t CLMDL4     : 1;            /*!< [8..8] Indicates that the L4 color format is enabled                      */
      __IOM uint32_t CLMDL1     : 1;            /*!< [9..9] Indicates that the L1 color format is enabled                      */
      __IOM uint32_t CLMDL8     : 1;            /*!< [10..10] Indicates that the L8 color format is enabled                    */
      __IOM uint32_t CLMDARGB8888 : 1;          /*!< [11..11] Indicates that the ARGB8888 32-bit color format is
                                                     enabled                                                                   */
      __IOM uint32_t CLMDRGB565 : 1;            /*!< [12..12] Indicates that the RGB565 16-bit color format is enabled         */
      __IOM uint32_t CLMDRGB332 : 1;            /*!< [13..13] Indicates that the RGB332 8-bit color format is enabled          */
      __IOM uint32_t CLMDRGBA8888 : 1;          /*!< [14..14] Indicates that the RGBA8888 32-bit color format is
                                                     enabled                                                                   */
      __IOM uint32_t CLMDRGBA5551 : 1;          /*!< [15..15] Indicates that the RGBA5551 16-bit color format is
                                                     enabled                                                                   */
      __IOM uint32_t CLMDLUT8   : 1;            /*!< [16..16] Indicates that the LUT8 color format is enabled                  */
      __IOM uint32_t CLMDTSC    : 1;            /*!< [17..17] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
      __IOM uint32_t CLMDTSC6   : 1;            /*!< [18..18] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
      __IOM uint32_t CLMDDBIBEXTCTRL : 1;       /*!< [19..19] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
      __IOM uint32_t CLMDQPI    : 1;            /*!< [20..20] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
      __IOM uint32_t CLMDRGBA4444 : 1;          /*!< [21..21] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
      __IOM uint32_t CLMDARGB4444 : 1;          /*!< [22..22] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
            uint32_t            : 6;
      __IOM uint32_t CLMDJDI    : 1;            /*!< [29..29] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
      __IOM uint32_t CLMDLVDS   : 1;            /*!< [30..30] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
      __IOM uint32_t CLMDBKPRESSURE : 1;        /*!< [31..31] Indicates that back pressure support for the DBI Type
                                                     B interface is enabled                                                    */
    } COLMOD_b;
  } ;
  __IM  uint32_t  RESERVED3[32];

  union {
    __IOM uint32_t CRC;                         /*!< (@ 0x00000184) if cyclic redundancy errors occur, they are written
                                                                    in the CRC register.                                       */

    struct {
      __IOM uint32_t CRCREG     : 32;           /*!< [31..0] CRC value if CRC error exists                                     */
    } CRC_b;
  } ;
  __IM  uint32_t  RESERVED4[158];

  union {
    __IOM uint32_t GLLUT;                       /*!< (@ 0x00000400) R[0]G[0]B[0] thru R[255]G[255]B[255] Global palette,
                                                                    gamma correction memory region where x starts
                                                                    at 0 thru 255.Access to all 256 registers
                                                                    is best accomplished by passing an index
                                                                    via a macro. e.g. pseudocode #define DC_L0LUT(n)
                                                                    (*((volatile uint32_t*)(&L0LUT + (4*n))))                  */

