zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t GLLUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t GLLUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t GLLUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
            uint32_t            : 8;
    } GLLUT_b;
  } ;
  __IM  uint32_t  RESERVED5[255];

  union {
    __IOM uint32_t CURSORDATA;                  /*!< (@ 0x00000800) Color values for the pixel cursor that are used
                                                                    with the Cursor LUT where x starts at 0
                                                                    thru 127.Access to all 16 registers is best
                                                                    accomplished by passing an index via a macro.
                                                                    e.g. pseudocode #define DC_CURSORDATA(n)
                                                                    (*((volatile uint32_t*)(&CURSORDATA + (4*n))))             */

    struct {
      __IOM uint32_t CURDATA70  : 8;            /*!< [7..0] Pixel 'xy' color look up bits                                      */
            uint32_t            : 4;
      __IOM uint32_t CURDATA3112 : 20;          /*!< [31..12] Pixel 'xy' color look up bits                                    */
    } CURSORDATA_b;
  } ;
  __IM  uint32_t  RESERVED6[127];

  union {
    __IOM uint32_t CURSORLUT;                   /*!< (@ 0x00000A00) R[0]G[0]B[0] thru R[15]G[15]B[15] Cursor Look-up
                                                                    Table where x starts at 0 thru 15.Access
                                                                    to all 16 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_CURSORLUT(n) (*((volatile uint32_t*)(&CURSORLUT
                                                                    + (4*n))))                                                 */

    struct {
      __IOM uint32_t CURLUT0B   : 8;            /*!< [7..0] Cursor LUT blue bits                                               */
      __IOM uint32_t CURLUT0G   : 8;            /*!< [15..8] Cursor LUT green bits                                             */
      __IOM uint32_t CURLUT0R   : 8;            /*!< [23..16] Cursor LUT red bits                                              */
            uint32_t            : 8;
    } CURSORLUT_b;
  } ;
  __IM  uint32_t  RESERVED7[383];

  union {
    __IOM uint32_t L0LUT;                       /*!< (@ 0x00001000) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255].
                                                                    Layer 0 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.                       */

    struct {
      __IOM uint32_t L0LUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t L0LUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t L0LUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t L0LUT0GAMRAMPA : 8;        /*!< [31..24] Gamma ramp alpha bits                                            */
    } L0LUT_b;
  } ;
  __IM  uint32_t  RESERVED8[255];

  union {
    __IOM uint32_t L1LUT;                       /*!< (@ 0x00001400) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]
                                                                    Layer 1 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.Access
                                                                    to all 256 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_L1LUT(n) (*((volatile uint32_t*)(&L1LUT
                                                                    + (4*n))))                                                 */

    struct {
      __IOM uint32_t L1LUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t L1LUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t L1LUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t L1LUT0GAMRAMPA : 8;        /*!< [31..24] Gamma ramp alpha bits                                            */
    } L1LUT_b;
  } ;
  __IM  uint32_t  RESERVED9[255];

  union {
    __IOM uint32_t L2LUT0;                      /*!< (@ 0x00001800) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]
                                                                    Layer 2 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.Access
                                                                    to all 256 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_L2LUT(n) (*((volatile uint32_t*)(&L2LUT
                                                                    + (4*n))))                                                 */

    struct {
      __IOM uint32_t L2LUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t L2LUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t L2LUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t L2LUT0GAMRAMPA : 8;        /*!< [31..24] Gamma ramp alpha bits                                            */
    } L2LUT0_b;
  } ;
  __IM  uint32_t  RESERVED10[255];

  union {
    __IOM uint32_t L3LUT;                       /*!< (@ 0x00001C00) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]
                                                                    Layer 3 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.Access
                                                                    to all 256 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_L3LUT(n) (*((volatile uint32_t*)(&L3LUT
                                                                    + (4*n))))                                                 */

