zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t HORZBKPCNT : 16;           /*!< [15..0] For Non Burst Sync pulse mode, for one lane. Minimum
                                                     HBP count = Hsync End short packet + HBP Blanking packet
                                                     overhead (header(4) + crc (2)) + RGB packet header For
                                                     other lane counts minimum value = Minimum HBPcount / lane_count.
                                                     For Non Burst Sync event / Burst Mode there is no HSA.
                                                     Minimum HBP count = (Hsync Start short packet + HBP Blanking
                                                     packet overhead + RGB packet header) / lane_count Min value
                                                     - 14 in decimal (accounted with zero payloads for blanking
                                                     packet] for one lane. Max value - any 12 bit v                            */
            uint32_t            : 16;
    } HORIZBKPORCHCNT_b;
  } ;

  union {
    __IOM uint32_t HORIZFPORCHCNT;              /*!< (@ 0x00000030) Shows the horizontal front porch value in terms
                                                                    of txbyteclkhs.                                            */

    struct {
      __IOM uint32_t HORZFTPCNT : 16;           /*!< [15..0] Minimum HFP period should be sufficient to transmit
                                                     RGB Data packet footer (2 bytes) + Blanking packet overhead
                                                     (6 bytes) +adjustable count (16 bytes) for non burst mode;
                                                     For other lane counts Minimum value = (RGB Data packet
                                                     footer(2 bytes) + Blanking packet overhead(6 bytes)) /
                                                     (lane_count) + adjustable count(16 bytes) For burst mode,
                                                     Minimum HFP period should be sufficient to transmit Blanking
                                                     packet overhead(6 bytes) +adjustable count (16 bytes) for
                                                     one lane for other lane counts Minimum value = ( Blan                     */
            uint32_t            : 16;
    } HORIZFPORCHCNT_b;
  } ;

  union {
    __IOM uint32_t HORZACTIVEAREACNT;           /*!< (@ 0x00000034) Horizontal active area count / time for active
                                                                    image data / Horizontal Address                            */

    struct {
      __IOM uint32_t HORACTCNT  : 16;           /*!< [15..0] Shows the horizontal active area value in terms of txbyteclkhs.
                                                     In Non Burst Mode, Count equal to RGB word count value
                                                     In Burst Mode, RGB pixel packets are time compressed, leaving
                                                     more time during a scan line for LP mode (saving power)
                                                     or for multiplexing other transmissions onto the DSI link.
                                                     Hence, the count equals the time in txbyteclkhs for sending
                                                     time compressed RGB pixels plus the time needed for moving
                                                     to power save mode or the time needed for secondary channel
                                                     to use the DSI link. But if the lef                                       */
            uint32_t            : 16;
    } HORZACTIVEAREACNT_b;
  } ;

  union {
    __IOM uint32_t VSYNCCNT;                    /*!< (@ 0x00000038) Shows the vertical sync value                              */

    struct {
      __IOM uint32_t VSC        : 16;           /*!< [15..0] Shows the vertical sync value in terms of lines. Min
                                                     value - 2 Max value - any 12 bit value greater than 2 based
                                                     on DPI resolution                                                         */
            uint32_t            : 16;
    } VSYNCCNT_b;
  } ;

  union {
    __IOM uint32_t VERTBKPORCHCNT;              /*!< (@ 0x0000003C) Shows the vertical back porch value                        */

    struct {
      __IOM uint32_t VBPSC      : 16;           /*!< [15..0] Shows the vertical back porch value in terms of lines.
                                                     Min value - 1; Max value - any 12 bit value greater than
                                                     1 based on DPI resolution                                                 */
            uint32_t            : 16;
    } VERTBKPORCHCNT_b;
  } ;

  union {
    __IOM uint32_t VERTFPORCHCNT;               /*!< (@ 0x00000040) Shows the vertical front porch value                       */

    struct {
      __IOM uint32_t VFPSC      : 16;           /*!< [15..0] Shows the vertical front porch value in terms of lines.
                                                     Min value - 1; Max value - any 12 bit value greater than
                                                     1 based on DPI resolution                                                 */
            uint32_t            : 16;
    } VERTFPORCHCNT_b;
  } ;

  union {
    __IOM uint32_t DATALANEHILOSWCNT;           /*!< (@ 0x00000044) High speed to low power or Low power to high
                                                                    speed switching time                                       */

    struct {
      __IOM uint32_t DATALHLSWCNT : 16;         /*!< [15..0] High speed to low power or Low power to high speed power
                                                     or Low switching time in terms byte clock (txbyteclkhs).
                                                     This power to high speed switch count value is based on
                                                     the byte clock (txbyteclkhs) and low power clock frequency
                                                     (txclkesc); Data lane Switch count = 4 * Tlpx + programmed
                                                     THS_prep + programmed THS_zero + 4 byteclk Tlpx = Low power
                                                     clock equivalence in of terms byte clock programmed in
                                                     AHB reg 68h; THS_prep = programmed value of dln_cnt_hs_prep
                                                     in AHB Reg 6ch bit (7:0) THS_zero = programmed v                          */
            uint32_t            : 16;
    } DATALANEHILOSWCNT_b;
  } ;

  union {
    __IOM uint32_t DPI;                         /*!< (@ 0x00000048) DPI control register.                                      */

