zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t RXCHANID   : 8;            /*!< [7..0] Channel ID value 0-255.                                            */
            uint32_t            : 24;
    } RXCHANID_b;
  } ;

  union {
    __IOM uint32_t RXFIFOSTATUS;                /*!< (@ 0x00000008) Holds the number of samples currently in the
                                                                    receive FIFO, and the empty condition flag                 */

    struct {
      __IOM uint32_t RXSAMPLECNT : 28;          /*!< [27..0] The count of the number of samples currently in the
                                                     receive FIFO.                                                             */
      __IOM uint32_t RXEMPTY    : 1;            /*!< [28..28] Receive FIFO empty bit. a 1 indicates the receive FIFO
                                                     is empty.                                                                 */
            uint32_t            : 3;
    } RXFIFOSTATUS_b;
  } ;

  union {
    __IOM uint32_t RXFIFOSIZE;                  /*!< (@ 0x0000000C) Holds the size of the receive FIFO in samples              */

    struct {
      __IOM uint32_t SIZE       : 32;           /*!< [31..0] Size of the receive FIFO in units of i2S samples. Read
                                                     only value.                                                               */
    } RXFIFOSIZE_b;
  } ;

  union {
    __IOM uint32_t RXUPPERLIMIT;                /*!< (@ 0x00000010) The number of samples required to be in the RX
                                                                    FIFO before asserting the RX_FFi interrupt
                                                                    bit                                                        */

    struct {
      __IOM uint32_t SIZE       : 32;           /*!< [31..0] When the I2S sample count stored within the receive
                                                     FIFO reaches this value or is larger, the interrupt RX_FFi
                                                     bit is asserted.                                                          */
    } RXUPPERLIMIT_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t TXDATA;                      /*!< (@ 0x00000020) Write only register to hold the i2S sample to
                                                                    transmit via the write FIFO                                */

    struct {
      __IOM uint32_t TXSAMPLE   : 32;           /*!< [31..0] 32b I2S sample to send out of the I2S module via the
                                                     external pins. All sample have the MSB in bit 31 regardless
                                                     of number of bits per sample and data justification                       */
    } TXDATA_b;
  } ;

  union {
    __IOM uint32_t TXCHANID;                    /*!< (@ 0x00000024) Channel ID used for the next audio sample to
                                                                    be written to the data transmission register               */

    struct {
      __IOM uint32_t TXCHANID   : 8;            /*!< [7..0] Channel ID value 0-255.                                            */
            uint32_t            : 24;
    } TXCHANID_b;
  } ;

  union {
    __IOM uint32_t TXFIFOSTATUS;                /*!< (@ 0x00000028) Holds the number of samples currently in the
                                                                    transmit FIFO, and the full condition flag                 */

    struct {
      __IOM uint32_t TXFIFOCNT  : 28;           /*!< [27..0] The count of the number of samples currently in the
                                                     transmit FIFO.                                                            */
      __IOM uint32_t TXFIFOFULL : 1;            /*!< [28..28] Transmit FIFO full bit. a 1 indicates the transmit
                                                     FIFO is full.                                                             */
            uint32_t            : 3;
    } TXFIFOSTATUS_b;
  } ;

  union {
    __IOM uint32_t TXFIFOSIZE;                  /*!< (@ 0x0000002C) Holds the size of the transmit FIFO in samples             */

    struct {
      __IOM uint32_t SIZE       : 32;           /*!< [31..0] Size of the transmit FIFO in units of I2S samples. Read
                                                     only value.                                                               */
    } TXFIFOSIZE_b;
  } ;

  union {
    __IOM uint32_t TXLOWERLIMIT;                /*!< (@ 0x00000030) Minimum number of samples have been reached in
                                                                    the transmit FIFO.                                         */

    struct {
      __IOM uint32_t SIZE       : 32;           /*!< [31..0] When the number of sample in the TX FIFO goes below
                                                     this value, the interrupt TX_FFi bit is asserted.                         */
    } TXLOWERLIMIT_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t I2SDATACFG;                  /*!< (@ 0x00000040) Specifies the data format of I2S sub frames                */

    struct {
      __IOM uint32_t SSZ1       : 3;            /*!< [2..0] Receive audio sample length for phase 1. 0: 8b, 2: 16b,
                                                     4: 24b, 5: 32b, 1,3,6,7: Reserved                                         */
      __IOM uint32_t JUST       : 1;            /*!< [3..3] Audio sample justification. 0: Left-justified, 1: Right-justified  */
            uint32_t            : 1;
      __IOM uint32_t WDLEN1     : 3;            /*!< [7..5] Receive channel length in bits for phase 1. 0: 8b, 2:
                                                     16b, 4: 24b, 5: 32b, 1,3,6,7: Reserved                                    */
      __IOM uint32_t FRLEN1     : 7;            /*!< [14..8] Number of channels in phase 1; 0: 1 Channel in phase
                                                     2, .. 0x7: 8 channels in phase 1                                          */
            uint32_t            : 1;
      __IOM uint32_t SSZ2       : 3;            /*!< [18..16] Receive audio sample length for phase 2. 0: 8b, 2:
                                                     16b, 4: 24b, 5: 32b, 1,3,6,7: Reserved                                    */
      __IOM uint32_t DATADLY    : 2;            /*!< [20..19] Receive data delay bit count. Valid values are 0-2,
                                                     3 is reserved.                                                            */
      __IOM uint32_t WDLEN2     : 3;            /*!< [23..21] Receive channel length in bits for phase 2. 0: 8b,
                                                     2: 16b, 4: 24b, 5: 32b, 1,3,6,7: Reserved                                 */
      __IOM uint32_t FRLEN2     : 7;            /*!< [30..24] Number of channels in phase 2; 0: 1 Channel in phase
                                                     2, .. 0x7: 8 channels in phase 2                                          */
      __IOM uint32_t PH         : 1;            /*!< [31..31] Read Phase Bit. 0: Single Phase frame; 1: Dual-Phase
                                                     frame.                                                                    */
    } I2SDATACFG_b;
  } ;

  union {
    __IOM uint32_t I2SIOCFG;                    /*!< (@ 0x00000044) Specified polarity and clock configuration of
                                                                    the I2S IPB clocks and IO signals                          */

