zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
            uint32_t            : 16;
      __IOM uint32_t COREID     : 8;            /*!< [23..16] Core ID of the IPB core                                          */
      __IOM uint32_t COREFAM    : 8;            /*!< [31..24] Core Family. Also bit 31 is used to set the I2S validity
                                                     bit when a write is done.                                                 */
    } IPCOREID_b;
  } ;

  union {
    __IOM uint32_t AMQCFG;                      /*!< (@ 0x00000054) Control the enablement of the ASRC module and
                                                                    the source of the MCLK used in the IPB core.               */

    struct {
      __IOM uint32_t MCLKSRC    : 1;            /*!< [0..0] MCLK source. 1: Output of nco_clk divider. 0: MCLK from
                                                     ambiq clock configuration directly                                        */
      __IOM uint32_t ASRCEN     : 1;            /*!< [1..1] ASRC sub module enable. 0: Enabled. 1: Disabled/Bypassed           */
            uint32_t            : 30;
    } AMQCFG_b;
  } ;
  __IM  uint32_t  RESERVED2[42];

  union {
    __IOM uint32_t CLKCFG;                      /*!< (@ 0x00000100) Provides clock selection and control for I2S
                                                                    clocks                                                     */

    struct {
      __IOM uint32_t MCLKEN     : 1;            /*!< [0..0] Enable for the master audio clock.                                 */
            uint32_t            : 3;
      __IOM uint32_t FSEL       : 5;            /*!< [8..4] Select the input clock frequency for the MCLK.Whenever
                                                     changing the clock source here, the MISC_HFRC2FRC bit in
                                                     the CLKGEN module must first be set. The sequence for changing
                                                     the clock source regardless of clock selection is to first
                                                     force HFRC2 on by setting the CLKGEN_MISC_HFRC2FRC bit,
                                                     select the clock source in this field, clear the CLKGEN_MISC_HFRC2FRC
                                                     bit only if HFRC2 is NOT selected, and then engage the
                                                     peripheral.If HFRC2 is the clock source, then shutting
                                                     the module down cleanly requires switchin                                 */
            uint32_t            : 3;
      __IOM uint32_t REFCLKEN   : 1;            /*!< [12..12] FUTURE USE Enable for the reference clock                        */
            uint32_t            : 3;
      __IOM uint32_t REFFSEL    : 2;            /*!< [17..16] FUTURE USE Select the input clock frequency for the
                                                     ref_clk. 0: HFRC_48MHz 1: HFRC_48MHz_GATED 2: XT_24MHz
                                                     3: HFRC2_48MHz                                                            */
            uint32_t            : 2;
      __IOM uint32_t DIV3       : 1;            /*!< [20..20] 0: no change to the clock selected by FSEL 1: frequency
                                                     divide-by-3 of the clock selected by FSEL                                 */
            uint32_t            : 11;
    } CLKCFG_b;
  } ;
  __IM  uint32_t  RESERVED3[63];

  union {
    __IOM uint32_t DMACFG;                      /*!< (@ 0x00000200) Configuration control of the DMA process, including
                                                                    the direction of DMA, and enablement of
                                                                    DMA                                                        */

    struct {
      __IOM uint32_t RXDMAEN    : 1;            /*!< [0..0] DMA Enable for RX channel. Setting this bit to EN will
                                                     start the DMA operation. This should be the last DMA related
                                                     register set prior to issuing the command                                 */
      __IOM uint32_t RXDMAPRI   : 1;            /*!< [1..1] Sets the Priority of the RXDMA request                             */
            uint32_t            : 2;
      __IOM uint32_t TXDMAEN    : 1;            /*!< [4..4] DMA Enable for TX channel. Setting this bit to EN will
                                                     start the DMA operation. This should be the last DMA related
                                                     register set prior to issuing the command                                 */
      __IOM uint32_t TXDMAPRI   : 1;            /*!< [5..5] Sets the Priority of the TXDMA request                             */
            uint32_t            : 2;
      __IOM uint32_t TXREQCNT   : 8;            /*!< [15..8] Number of blocks of samples transferred before asserting
                                                     the TXREQCNT interrupt signal. A block is 8 samples. The
                                                     interrupt will assert if enabled and after TXREQCNT blocks
                                                     of data has been transferred to the I2S module from the
                                                     device. A value of 0 will cause the assertion of the interrupt
                                                     for every block of transfer done.                                         */
      __IOM uint32_t RXREQCNT   : 8;            /*!< [23..16] Number of blocks of samples transferred before asserting
                                                     the RXREQCNT interrupt signal. A block is 8 samples. The
                                                     interrupt will assert if enabled and after RXREQCNT blocks
                                                     of data has been transferred from the I2S into the device.
                                                     A value of 0 will cause the assertion of the interrupt
                                                     for every block of transfer done.                                         */
            uint32_t            : 8;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t RXDMATOTCNT;                 /*!< (@ 0x00000204) Contains the total count of samples to be stored
                                                                    for the current RX DMA operation. This register
                                                                    is updated as DMA beats complete.                          */

