zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t CHIPID0    : 32;           /*!< [31..0] Unique chip ID 0.                                                 */
    } CHIPID0_b;
  } ;

  union {
    __IOM uint32_t CHIPID1;                     /*!< (@ 0x00000008) Unique Chip ID 1                                           */

    struct {
      __IOM uint32_t CHIPID1    : 32;           /*!< [31..0] Unique chip ID 1.                                                 */
    } CHIPID1_b;
  } ;

  union {
    __IOM uint32_t CHIPREV;                     /*!< (@ 0x0000000C) Chip Revision                                              */

    struct {
      __IOM uint32_t REVMIN     : 4;            /*!< [3..0] Minor Revision ID.                                                 */
      __IOM uint32_t REVMAJ     : 4;            /*!< [7..4] Major Revision ID.                                                 */
      __IOM uint32_t SIPART     : 12;           /*!< [19..8] Silicon Part ID                                                   */
            uint32_t            : 12;
    } CHIPREV_b;
  } ;

  union {
    __IOM uint32_t VENDORID;                    /*!< (@ 0x00000010) Unique Vendor ID                                           */

    struct {
      __IOM uint32_t VENDORID   : 32;           /*!< [31..0] Unique Vendor ID                                                  */
    } VENDORID_b;
  } ;

  union {
    __IOM uint32_t SKU;                         /*!< (@ 0x00000014) Unique Chip SKU                                            */

    struct {
      __IOM uint32_t SKUSRAMSIZE : 2;           /*!< [1..0] SRAM SKU dictates the available memory for MCU. All of
                                                     the MCU TCM (384KB) and System SRAM (2MB) available by
                                                     default. Memory SU disabled                                               */
      __IOM uint32_t SKUMRAMSIZE : 2;           /*!< [3..2] MRAM size SKU. All of 2MB Available by default. Memory
                                                     SU disabled                                                               */
      __IOM uint32_t SKUDSP     : 2;            /*!< [5..4] DSP availability SKU setting. 384K available by default.
                                                     Memory SU disabled                                                        */
      __IOM uint32_t SKUTURBOSPOT : 1;          /*!< [6..6] High performance mode for MCU and DSPs.                            */
      __IOM uint32_t SKUMIPIDSI : 1;            /*!< [7..7] MIPI DSI available                                                 */
      __IOM uint32_t SKUGFX     : 1;            /*!< [8..8] GFX available                                                      */
      __IOM uint32_t SKUUSB     : 1;            /*!< [9..9] USB available                                                      */
      __IOM uint32_t SKUSECURESPOT : 1;         /*!< [10..10] Secure boot feature                                              */
            uint32_t            : 21;
    } SKU_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t DEBUGGER;                    /*!< (@ 0x00000020) Debugger Control                                           */

    struct {
      __IOM uint32_t LOCKOUT    : 32;           /*!< [31..0] Lockout of debugger (SWD).                                        */
    } DEBUGGER_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t ACRG;                        /*!< (@ 0x00000028) Active Current Reference Generator Control                 */

    struct {
      __IOM uint32_t ACRGSWE    : 1;            /*!< [0..0] Software enablement for ACRG register. A value of 1 will
                                                     allow writes to the register                                              */
      __IOM uint32_t ACRGPWD    : 1;            /*!< [1..1] Power down the ACRG.                                               */
      __IOM uint32_t ACRGIBIASSEL : 1;          /*!< [2..2] Set the ACRG ibias. Note: the SWE mux select in PWRSEQ2SWE
                                                     must be set for this to take effect. The inversion of this
                                                     register is driven to analog.                                             */
      __IOM uint32_t ACRGTRIM   : 5;            /*!< [7..3] ACRG Trim value                                                    */
            uint32_t            : 24;
    } ACRG_b;
  } ;
  __IM  uint32_t  RESERVED2[6];

  union {
    __IOM uint32_t VREFGEN2;                    /*!< (@ 0x00000044) Voltage Reference Generator 2 Control                      */

    struct {
      __IOM uint32_t TVRGTEMPCOTRIM : 5;        /*!< [4..0] Calibrated Voltage Reference Generator tc trim (bottom
                                                     transistor)                                                               */
      __IOM uint32_t TVRGPWD    : 1;            /*!< [5..5] Power Down, Calibrated Voltage Reference Generator.                */
      __IOM uint32_t TVRGCURRENTTRIM : 1;       /*!< [6..6] Calibrated voltage reference current trim.                         */
      __IOM uint32_t TVRGVREFTRIM : 7;          /*!< [13..7] Calibrated voltage reference 580m trim                            */
      __IOM uint32_t TVRG2TEMPCOTRIM : 5;       /*!< [18..14] Calibrated Voltage Reference Generator tc trim (bottom
                                                     transistor)                                                               */
      __IOM uint32_t TVRG2PWD   : 1;            /*!< [19..19] Power Down, Calibrated Voltage Reference Generator.              */
      __IOM uint32_t TVRG2CURRENTTRIM : 1;      /*!< [20..20] Calibrated voltage reference current trim.                       */
      __IOM uint32_t TVRG2VREFTRIM : 7;         /*!< [27..21] Calibrated voltage reference 580m trim                           */
      __IOM uint32_t TVRGSELVREF : 1;           /*!< [28..28] TVRG SEL VREF                                                    */
      __IOM uint32_t TVRG2SELVREF : 1;          /*!< [29..29] TVRG2 SEL VREF                                                   */
            uint32_t            : 2;
    } VREFGEN2_b;
  } ;
  __IM  uint32_t  RESERVED3[6];

  union {
    __IOM uint32_t VRCTRL;                      /*!< (@ 0x00000060) Overrides for Voltage Regulators Controls                  */

