zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t BODLRDE    : 1;            /*!< [0..0] Disable Unregulated 1.8V Brown-out reset.                          */
      __IOM uint32_t BODCREN    : 1;            /*!< [1..1] Disable VDDC Brown Out reset.                                      */
      __IOM uint32_t BODFREN    : 1;            /*!< [2..2] Disable VDDF Brown Out reset.                                      */
      __IOM uint32_t BODSREN    : 1;            /*!< [3..3] Disable VDDS Brown Out reset.                                      */
      __IOM uint32_t BODCLVREN  : 1;            /*!< [4..4] Disable VDDC_LV Brown Out reset.                                   */
            uint32_t            : 27;
    } BODISABLE_b;
  } ;

  union {
    __IOM uint32_t D2ASPARE;                    /*!< (@ 0x000001B0) Spare registers to analog module                           */

    struct {
            uint32_t            : 3;
      __IOM uint32_t VDDCPUOVERRIDE : 1;        /*!< [3..3] VDDCPU Override. Set to 1 to connect to the VDDC rail,
                                                     set to 0 to connect to the VDDC_LV rail. Before setting
                                                     this bit to 0, the VDDC_LV rail must first be enabled by
                                                     setting SIMOBUCK0_b.VDDCLVRXCOMPEN. Do not modify this
                                                     field unless directed to do so by Ambiq engineering. If
                                                     modifying, a RMW operation such as MCUCTRL->D2ASPARE_b.VDDCPUOVERRIDE=1
                                                     must be used.                                                             */
      __IOM uint32_t VDDCAOROVERRIDE : 1;       /*!< [4..4] VDDCAOR Override. Set to 1 to connect to the VDDC rail,
                                                     set to 0 to connect to the VDDC_LV rail. Before setting
                                                     this bit to 0, the VDDC_LV rail must first be enabled by
                                                     setting SIMOBUCK0_b.VDDCLVRXCOMPEN. Do not modify this
                                                     field unless directed to do so by Ambiq engineering. If
                                                     modifying, a RMW operation such as MCUCTRL->D2ASPARE_b.VDDCAOROVERRIDE=1
                                                     must be used.                                                             */
            uint32_t            : 27;
    } D2ASPARE_b;
  } ;
  __IM  uint32_t  RESERVED12;

  union {
    __IOM uint32_t BOOTLOADER;                  /*!< (@ 0x000001B8) Bootloader and secure boot functions                       */

    struct {
      __IOM uint32_t BOOTLOADERLOW : 1;         /*!< [0..0] Determines whether the bootloader code is visible at
                                                     address 0x00000000 or not. Resets to 1, write 1 to clear.                 */
      __IOM uint32_t SBRLOCK    : 1;            /*!< [1..1] Secure boot ROM lock. Always resets to 1, write 1 to
                                                     clear. Enables system visibility to bootloader until set.                 */
      __IOM uint32_t PROTLOCK   : 1;            /*!< [2..2] This field controls access to OEM keybank and restricts
                                                     further application of NVM protections via the FLASHWPROTn
                                                     and FLASHRPROTn registers. On read, 0 indicates locked,
                                                     1 indicates unlocked. Write 1 to clear the field (assert
                                                     the lock). Default value of the hardware is 1 (unlocked),
                                                     but the default value is also affected by INFOC_SECURITY->PLONEXIT.
                                                     If PLONEXIT is set, PROTLOCK is asserted by SBL and the
                                                     OEM application will see the value as 0 (locked).                         */
      __IOM uint32_t SBLLOCK    : 1;            /*!< [3..3] Secure boot loader lock. Always resets to 1, write 1
                                                     to clear. Enables system visibility to bootloader until
                                                     set.                                                                      */
            uint32_t            : 22;
      __IOM uint32_t SECBOOTFEATURE : 2;        /*!< [27..26] Indicates whether the secure boot feature is enabled.            */
      __IOM uint32_t SECBOOT    : 2;            /*!< [29..28] Indicates whether the secure boot on cold reset is
                                                     enabled                                                                   */
      __IOM uint32_t SECBOOTONRST : 2;          /*!< [31..30] Indicates whether the secure boot on warm reset is
                                                     enabled                                                                   */
    } BOOTLOADER_b;
  } ;

  union {
    __IOM uint32_t SHADOWVALID;                 /*!< (@ 0x000001BC) Register to indicate whether the shadow registers
                                                                    have been successfully loaded from the Flash
                                                                    Information Space.                                         */

    struct {
      __IOM uint32_t VALID      : 1;            /*!< [0..0] Indicates whether the shadow registers contain valid
                                                     data from the Flash Information Space.                                    */
      __IOM uint32_t BLDSLEEP   : 1;            /*!< [1..1] Indicates whether the bootloader should sleep or deep
                                                     sleep if no image loaded.                                                 */
      __IOM uint32_t INFO0VALID : 1;            /*!< [2..2] Indicates whether info0 contains valid data                        */
            uint32_t            : 29;
    } SHADOWVALID_b;
  } ;

  union {
    __IOM uint32_t SCRATCH0;                    /*!< (@ 0x000001C0) Scratch register that is not reset by any reset            */

