zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t KEXTCLKSEL : 32;           /*!< [31..0] Key register value.                                               */
    } KEXTCLKSEL_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK0;                   /*!< (@ 0x0000033C) This WRITE_ONLY register controls various buck
                                                                    parameters. It will read back as 0x00000000.               */

    struct {
      __IOM uint32_t VDDCRXCOMPEN : 1;          /*!< [0..0] Enable the VDDC rail.                                              */
      __IOM uint32_t VDDFRXCOMPEN : 1;          /*!< [1..1] Enable the VDDS rail.                                              */
      __IOM uint32_t VDDSRXCOMPEN : 1;          /*!< [2..2] Enable the VDDS rail.                                              */
      __IOM uint32_t VDDCLVRXCOMPEN : 1;        /*!< [3..3] Enable the VDDC LV rail.                                           */
      __IOM uint32_t TONTOFFNODEGLITCH : 1;     /*!< [4..4] Enable the ton and toff signals no deglitch output.                */
            uint32_t            : 27;
    } SIMOBUCK0_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK1;                   /*!< (@ 0x00000340) 1. Control the even division of 3 clocks: refresh,
                                                                    low power and TONCLK. 2. Control gap bewteen
                                                                    secondary switches. 3. Debug features: control
                                                                    the amount of time TONCLK is on, and the
                                                                    time before snubber asserts for each buck
                                                                    sequence. 4. Enable or disable the observation
                                                                    bus. 5. Select the buck sequence operation
                                                                    mode. 6. Control delay between primary Pmos
                                                                    and Nmos transitions.                                      */

    struct {
            uint32_t            : 6;
      __IOM uint32_t RXCLKACTTRIM : 5;          /*!< [10..6] This divides the 5 MHz refresh clock. Even divides are
                                                     supported only. This value represents the division amount
                                                     minus 1.                                                                  */
            uint32_t            : 11;
      __IOM uint32_t TONCLKTRIM : 4;            /*!< [25..22] This divides the 100 MHz ton clock. Even divides are
                                                     supported only. This value represents the division amount
                                                     minus 1.                                                                  */
            uint32_t            : 6;
    } SIMOBUCK1_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK2;                   /*!< (@ 0x00000344) SIMO Buck Muxed VDDC Active Sequence Trim Control          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t VDDCACTHIGHTONTRIM : 4;    /*!< [14..11] VDDC active high ton trim control for Buck sequence.             */
            uint32_t            : 9;
      __IOM uint32_t VDDCACTLOWTONTRIM : 5;     /*!< [28..24] VDDC active high ton trim control for Buck sequence.             */
            uint32_t            : 3;
    } SIMOBUCK2_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK3;                   /*!< (@ 0x00000348) SIMO Buck Muxed VDDC low power Sequence Trim
                                                                    Control                                                    */

    struct {
            uint32_t            : 13;
      __IOM uint32_t VDDCLPHIGHTONTRIM : 4;     /*!< [16..13] VDDC LP high ton trim control for Buck sequence.                 */
            uint32_t            : 9;
      __IOM uint32_t VDDCLPLOWTONTRIM : 4;      /*!< [29..26] VDDC LP low ton trim control for Buck sequence.                  */
            uint32_t            : 2;
    } SIMOBUCK3_b;
  } ;
  __IM  uint32_t  RESERVED19[2];

  union {
    __IOM uint32_t SIMOBUCK6;                   /*!< (@ 0x00000354) SIMO Buck Muxed VDDF Active Sequence Trim Control          */

    struct {
            uint32_t            : 17;
      __IOM uint32_t VDDFACTHIGHTONTRIM : 4;    /*!< [20..17] VDDF active high ton trim control for Buck sequence.             */
            uint32_t            : 11;
    } SIMOBUCK6_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK7;                   /*!< (@ 0x00000358) SIMO Buck Muxed VDDF active Sequence Trim Control          */

    struct {
            uint32_t            : 8;
      __IOM uint32_t VDDFACTLOWTONTRIM : 5;     /*!< [12..8] VDDF active low ton trim control for Buck sequence.               */
            uint32_t            : 5;
      __IOM uint32_t ZXCOMPZXTRIM : 5;          /*!< [22..18] Zxcomp trim. Feedthrough to analog.                              */
            uint32_t            : 9;
    } SIMOBUCK7_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK8;                   /*!< (@ 0x0000035C) SIMO Buck Muxed VDDF Low Power Sequence Trim
                                                                    Control                                                    */

    struct {
            uint32_t            : 9;
      __IOM uint32_t VDDFLPHIGHTONTRIM : 4;     /*!< [12..9] VDDF low power high ton trim control for Buck sequence.           */
            uint32_t            : 9;
      __IOM uint32_t VDDFLPLOWTONTRIM : 4;      /*!< [25..22] VDDF low power low ton trim control for Buck sequence.           */
            uint32_t            : 6;
    } SIMOBUCK8_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK9;                   /*!< (@ 0x00000360) SIMO Buck Muxed VDDS Active Sequence Trim Control          */

