zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t DMAWPROT1  : 16;           /*!< [15..0] Write protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA writes, when set
                                                     to 0, DMA may write the region.                                           */
            uint32_t            : 16;
    } DMASRAMWPROT1_b;
  } ;

  union {
    __IOM uint32_t DMASRAMRPROT0;               /*!< (@ 0x000003D0) These bits read-protect system SRAM from DMA
                                                                    operations in 8KB chunks.                                  */

    struct {
      __IOM uint32_t DMARPROT0  : 32;           /*!< [31..0] Read protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA reads, when set to
                                                     0, DMA may read the region.                                               */
    } DMASRAMRPROT0_b;
  } ;

  union {
    __IOM uint32_t DMASRAMRPROT1;               /*!< (@ 0x000003D4) These bits read-protect system SRAM from DMA
                                                                    operations in 8KB chunks.                                  */

    struct {
      __IOM uint32_t DMARPROT1  : 16;           /*!< [15..0] Read protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA reads, when set to
                                                     0, DMA may read the region.                                               */
            uint32_t            : 16;
    } DMASRAMRPROT1_b;
  } ;
  __IM  uint32_t  RESERVED24[16];

  union {
    __IOM uint32_t USBPHYRESET;                 /*!< (@ 0x00000418) DSP0 CACHE RAM TRIM                                        */

    struct {
      __IOM uint32_t USBPHYPORRSTDIS : 1;       /*!< [0..0] De-assert USB PHY POR reset override                               */
      __IOM uint32_t USBPHYUTMIRSTDIS : 1;      /*!< [1..1] De-assert USB PHY UTMI reset override                              */
      __IOM uint32_t RESERVED01 : 3;            /*!< [4..2] DSP0 ICACHE TAG EMA                                                */
      __IOM uint32_t RESERVED02 : 1;            /*!< [5..5] DSP0 ICACHE TAG EMAS                                               */
      __IOM uint32_t RESERVED03 : 2;            /*!< [7..6] DSP0 ICACHE TAG EMAW                                               */
      __IOM uint32_t RESERVED04 : 1;            /*!< [8..8] DSP0 ICACHE TAG RAWL                                               */
      __IOM uint32_t RESERVED05 : 2;            /*!< [10..9] DSP0 ICACHE TAG RAWLM                                             */
      __IOM uint32_t RESERVED06 : 1;            /*!< [11..11] DSP0 ICACHE TAG RAM WABL - Write Assist Enable (active
                                                     high)                                                                     */
      __IOM uint32_t RESERVED07 : 3;            /*!< [14..12] DSP0 ICACHE TAG WABLM - 00=No adjust 11=increased delay,
                                                     enabled by WABL                                                           */
            uint32_t            : 1;
      __IOM uint32_t RESERVED09 : 1;            /*!< [16..16] DSP0 ICACHE DATA RET1N value                                     */
      __IOM uint32_t RESERVED10 : 1;            /*!< [17..17] Override for DSP0 ICACHE DATA RET1N override enable              */
      __IOM uint32_t RESERVED11 : 3;            /*!< [20..18] DSP0 ICACHE DATA EMA                                             */
      __IOM uint32_t RESERVED12 : 1;            /*!< [21..21] DSP0 ICACHE DATA EMAS                                            */
      __IOM uint32_t RESERVED13 : 2;            /*!< [23..22] DSP0 ICACHE DATA EMAW                                            */
      __IOM uint32_t RESERVED14 : 1;            /*!< [24..24] DSP0 ICACHE DATA RAWL                                            */
      __IOM uint32_t RESERVED15 : 2;            /*!< [26..25] DSP0 ICACHE DATA RAWLM                                           */
      __IOM uint32_t RESERVED16 : 1;            /*!< [27..27] DSP0 ICACHE DATA RAM WABL - Write Assist Enable (active
                                                     high)                                                                     */
      __IOM uint32_t RESERVED17 : 3;            /*!< [30..28] DSP0 ICACHE DATA WABLM - 00=No adjust 11=increased
                                                     delay, enabled by WABL                                                    */
      __IOM uint32_t RESERVED18 : 1;            /*!< [31..31] Self-timed override (test mode only)                             */
    } USBPHYRESET_b;
  } ;
  __IM  uint32_t  RESERVED25[4];

  union {
    __IOM uint32_t AUDADCPWRCTRL;               /*!< (@ 0x0000042C) Audio ADC Power Control                                    */

    struct {
      __IOM uint32_t AUDADCPWRCTRLSWE : 1;      /*!< [0..0] Audio ADC Power Control Software Override Enable                   */
      __IOM uint32_t AUDADCAPSEN : 1;           /*!< [1..1] Enable the Global audio ADC Power Switch on when set
                                                     to 1 if the AUDADCPWRCTRLSWE bit is set.                                  */
      __IOM uint32_t AUDADCBPSEN : 1;           /*!< [2..2] Enable the Analog, IO and SAR Digital logic Power Switch
                                                     on when set to 1 if the AUDADCPWRCTRLSWE bit is set.                      */
      __IOM uint32_t AUDBGTPEN  : 1;            /*!< [3..3] Bandgap and Temperature Sensor Power Switch Enable                 */
      __IOM uint32_t AUDREFBUFPEN : 1;          /*!< [4..4] Reference Buffer Power Switch Enable                               */
      __IOM uint32_t AUDREFKEEPPEN : 1;         /*!< [5..5] Reference Buffer Keeper Power Switch Enable                        */
            uint32_t            : 2;
      __IOM uint32_t VDDAUDADCSARISOLATE : 1;   /*!< [8..8] ISOLATE signal for Power Switched SAR ( when AUDADCBPSEN
                                                     is switched off )                                                         */
      __IOM uint32_t VDDAUDADCDIGISOLATE : 1;   /*!< [9..9] ISOLATE signal for audio ADC Digital Contoller ( when
                                                     AUDADCAPSEN is switched off and if the AUDADCPWRCTRLSWE
                                                     bit is set)                                                               */
      __IOM uint32_t VDDAUDADCRESETN : 1;       /*!< [10..10] RESETN signal for Power Switched SAR and Digital Controller
                                                     (when global power switch is off and if the AUDADCPWRCTRLSWE
                                                     bit is set)                                                               */
            uint32_t            : 1;
      __IOM uint32_t AUDADCVBATDIVEN : 1;       /*!< [12..12] Audio ADC VBAT DIV Power Enable ( if the AUDADCPWRCTRLSWE
                                                     bit is set )                                                              */
            uint32_t            : 1;
      __IOM uint32_t AUDADCINBUFSEL : 2;        /*!< [15..14] Audio ADC input buffer mux select                                */
      __IOM uint32_t AUDADCINBUFEN : 1;         /*!< [16..16] Audio ADC Input Buffer Power Enable ( if the AUDADCPWRCTRLSWE
                                                     bit is set )                                                              */
      __IOM uint32_t AUDADCRFBUFSLWEN : 1;      /*!< [17..17] Audio ADC reference buffer slew enable                           */
      __IOM uint32_t AUDADCKEEPOUTEN : 1;       /*!< [18..18] Audio ADC reference keeper out en                                */
            uint32_t            : 13;
    } AUDADCPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t AUDIO1;                      /*!< (@ 0x00000430) Audio trims 1                                              */

