zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t WTLPDISPPHY : 4;           /*!< [3..0] Weight used for LP mode DISP PHY                                   */
      __IOM uint32_t WTLPUSBPHY : 4;            /*!< [7..4] Weight used for LP mode USB PHY                                    */
            uint32_t            : 24;
    } PWRWEIGHTLP5_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP0;                /*!< (@ 0x00000170) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTHPMCU    : 4;            /*!< [3..0] Weight used for HP mode MCU                                        */
      __IOM uint32_t WTHPDSP0   : 4;            /*!< [7..4] Weight used for HP mode DSP0                                       */
      __IOM uint32_t WTHPDSP1   : 4;            /*!< [11..8] Weight used for HP mode DSP1                                      */
      __IOM uint32_t WTHPIOS    : 4;            /*!< [15..12] Weight used for HP mode IOS                                      */
      __IOM uint32_t WTHPUART0  : 4;            /*!< [19..16] Weight used for HP mode UART0                                    */
      __IOM uint32_t WTHPUART1  : 4;            /*!< [23..20] Weight used for HP mode UART1                                    */
      __IOM uint32_t WTHPUART2  : 4;            /*!< [27..24] Weight used for HP mode UART2                                    */
      __IOM uint32_t WTHPUART3  : 4;            /*!< [31..28] Weight used for HP mode UART3                                    */
    } PWRWEIGHTHP0_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP1;                /*!< (@ 0x00000174) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTHPIOM0   : 4;            /*!< [3..0] Weight used for HP mode IOM0                                       */
      __IOM uint32_t WTHPIOM1   : 4;            /*!< [7..4] Weight used for HP mode IOM1                                       */
      __IOM uint32_t WTHPIOM2   : 4;            /*!< [11..8] Weight used for HP mode IOM2                                      */
      __IOM uint32_t WTHPIOM3   : 4;            /*!< [15..12] Weight used for HP mode IOM3                                     */
      __IOM uint32_t WTHPIOM4   : 4;            /*!< [19..16] Weight used for HP mode IOM4                                     */
      __IOM uint32_t WTHPIOM5   : 4;            /*!< [23..20] Weight used for HP mode IOM5                                     */
      __IOM uint32_t WTHPIOM6   : 4;            /*!< [27..24] Weight used for HP mode IOM6                                     */
      __IOM uint32_t WTHPIOM7   : 4;            /*!< [31..28] Weight used for HP mode IOM7                                     */
    } PWRWEIGHTHP1_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP2;                /*!< (@ 0x00000178) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTHPADC    : 4;            /*!< [3..0] Weight used for HP mode ADC                                        */
      __IOM uint32_t WTHPMSPI0  : 4;            /*!< [7..4] Weight used for HP mode MSPI0                                      */
      __IOM uint32_t WTHPMSPI1  : 4;            /*!< [11..8] Weight used for HP mode MSPI1                                     */
      __IOM uint32_t WTHPGFX    : 4;            /*!< [15..12] Weight used for HP mode GFX                                      */
      __IOM uint32_t WTHPDISP   : 4;            /*!< [19..16] Weight used for HP mode DISP                                     */
      __IOM uint32_t WTHPCRYPTO : 4;            /*!< [23..20] Weight used for HP mode CRYPTO                                   */
      __IOM uint32_t WTHPSDIO   : 4;            /*!< [27..24] Weight used for HP mode SDIO                                     */
      __IOM uint32_t WTHPUSB    : 4;            /*!< [31..28] Weight used for HP mode USB                                      */
    } PWRWEIGHTHP2_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP3;                /*!< (@ 0x0000017C) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTHPDSPA   : 4;            /*!< [3..0] Weight used for HP mode DSPA                                       */
      __IOM uint32_t WTHPDBG    : 4;            /*!< [7..4] Weight used for HP mode DBG                                        */
      __IOM uint32_t WTHPAUDREC : 4;            /*!< [11..8] Weight used for HP mode AUDREC                                    */
      __IOM uint32_t WTHPAUDPB  : 4;            /*!< [15..12] Weight used for HP mode AUDPB                                    */
      __IOM uint32_t WTHPAUDADC : 4;            /*!< [19..16] Weight used for HP mode AUDADC                                   */
            uint32_t            : 8;
      __IOM uint32_t WTHPMSPI2  : 4;            /*!< [31..28] Weight used for HP mode MSPI2                                    */
    } PWRWEIGHTHP3_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP4;                /*!< (@ 0x00000180) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

