zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t ADMAERRORSTATE : 2;        /*!< [1..0] This field indicates the state of ADMA when error is
                                                     occurred during ADMA data transfer. This field never indicates
                                                     10 because ADMA never stops in this state. D01 - D00 :
                                                     ADMA Error State when error occurred Contents of SYS_SDR
                                                     register                                                                  */
      __IOM uint32_t ADMALENMISMATCHERR : 1;    /*!< [2..2] This error occurs in the following 2 cases. While Block
                                                     Count Enable being set, the total data length specified
                                                     by the Descriptor table is different from that specified
                                                     by the Block Count and Block Length. Total data length
                                                     can not be divided by the block length.                                   */
            uint32_t            : 29;
    } ADMA_b;
  } ;

  union {
    __IOM uint32_t ADMALOWD;                    /*!< (@ 0x00000058) ADMA system address [31:0]                                 */

    struct {
      __IOM uint32_t LOWD       : 32;           /*!< [31..0] This register holds byte address of executing command
                                                     of the Descriptor table. 32-bit Address Descriptor uses
                                                     lower 32bit of this register. At the start of ADMA, the
                                                     Host Driver shall set start address of the Descriptor table.
                                                     The ADMA increments this register address, which points
                                                     to next line, when every fetching a Descriptor line. When
                                                     the ADMA Error Interrupt is generated, this register shall
                                                     hold valid Descriptor address depending on the ADMA state.
                                                     The Host Driver shall program Descriptor Table on 32                      */
    } ADMALOWD_b;
  } ;

  union {
    __IOM uint32_t ADMAHIWD;                    /*!< (@ 0x0000005C) ADMA system address [63:0]                                 */

    struct {
      __IOM uint32_t HIWD       : 32;           /*!< [31..0] This register holds byte address of executing command
                                                     of the Descriptor table. 32-bit Address Descriptor uses
                                                     lower 32bit of this register. At the start of ADMA, the
                                                     Host Driver shall set start address of the Descriptor table.
                                                     The ADMA increments this register address, which points
                                                     to next line, when every fetching a Descriptor line. When
                                                     the ADMA Error Interrupt is generated, this register shall
                                                     hold valid Descriptor address depending on the ADMA state.
                                                     The Host Driver shall program Descriptor Table on 32                      */
    } ADMAHIWD_b;
  } ;

  union {
    __IOM uint32_t PRESET0;                     /*!< (@ 0x00000060) Preset Value initialization and default speed              */

    struct {
      __IOM uint32_t HISPSDCLKFREQSEL : 10;     /*!< [9..0] 10 bit preset value to set SDCLK Frequency Select in
                                                     the Clock Control Register is described by a host system.
                                                     When Host Controller supports shared bus, a set of Preset
                                                     Value registers for each device required and the registers
                                                     location are duplicated to the offset 06Fh-060h. A set
                                                     of Preset Value registers can be accessible by selecting
                                                     Clock Pin Select in the Shared Bus Control register                       */
      __IOM uint32_t HISPCLKGENSEL : 1;         /*!< [10..10] This bit is effective when Host Controller supports
                                                     programmable clock generator.                                             */
            uint32_t            : 3;
      __IOM uint32_t HISPDRVRSTRSEL : 2;        /*!< [15..14] Driver Strength is supported by 1.8V signaling bus
                                                     speed modes. This field is meaningless for 3.3V signaling.                */
      __IOM uint32_t DEFSPSDCLKFREQSEL : 10;    /*!< [25..16] 10 bit preset value to set SDCLK Frequency Select in
                                                     the Clock Control Register is described by a host system.
                                                     When Host Controller supports shared bus, a set of Preset
                                                     Value registers for each device required and the registers
                                                     location are duplicated to the offset 06Fh-060h. A set
                                                     of Preset Value registers can be accessible by selecting
                                                     Clock Pin Select in the Shared Bus Control register                       */
      __IOM uint32_t DEFSPCLKGENSEL : 1;        /*!< [26..26] This bit is effective when Host Controller supports
                                                     programmable clock generator.                                             */
            uint32_t            : 3;
      __IOM uint32_t DEFSPDRVRSTRSEL : 2;       /*!< [31..30] Driver Strength is supported by 1.8V signaling bus
                                                     speed modes. This field is meaningless for 3.3V signaling.                */
    } PRESET0_b;
  } ;

  union {
    __IOM uint32_t PRESET1;                     /*!< (@ 0x00000064) Preset Value for high speed and SDR12                      */

