zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t TMR4EN     : 1;            /*!< [0..0] Counter/Timer 4 Enable bit.                                        */
      __IOM uint32_t TMR4CLR    : 1;            /*!< [1..1] Counter/Timer Clear bit.                                           */
      __IOM uint32_t TMR4POL0   : 1;            /*!< [2..2] Counter/Timer 4 output 0 polarity.                                 */
      __IOM uint32_t TMR4POL1   : 1;            /*!< [3..3] Counter/Timer 4 output 1 polarity.                                 */
      __IOM uint32_t TMR4FN     : 4;            /*!< [7..4] Counter/Timer 4 Function Select. For all Functions, CMP0
                                                     marks the end of timer cycle, and thus restarts the timer.                */
      __IOM uint32_t TMR4CLK    : 8;            /*!< [15..8] Counter/Timer 4 Clock Select.                                     */
      __IOM uint32_t TMR4TMODE  : 2;            /*!< [17..16] Counter/Timer 4 Trigger Mode                                     */
            uint32_t            : 6;
      __IOM uint32_t TMR4LMT    : 8;            /*!< [31..24] This field decides the number of iterations of Counter/Timer
                                                     4. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL4_b;
  } ;

  union {
    __IOM uint32_t TIMER4;                      /*!< (@ 0x00000284) This register holds the running time or event
                                                                    count for timer 4.                                         */

    struct {
      __IOM uint32_t TIMER4     : 32;           /*!< [31..0] Counter/Timer 4                                                   */
    } TIMER4_b;
  } ;

  union {
    __IOM uint32_t TMR4CMP0;                    /*!< (@ 0x00000288) This contains the Compare limits for timer 4.
                                                                    This is the primary comparator that can
                                                                    be used to mark the END of a timer cycle
                                                                    (and thus restart the timer for repeat modes)              */

    struct {
      __IOM uint32_t TMR4CMP0   : 32;           /*!< [31..0] Counter/Timer 4 End Compare Register. For MEASURE mode
                                                     indicates the high phase sample count.                                    */
    } TMR4CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR4CMP1;                    /*!< (@ 0x0000028C) This comparator is used as a secondary compare
                                                                    count for modes that generate pulses. For
                                                                    MEASURE mode indicates the low phase sample
                                                                    count.                                                     */

    struct {
      __IOM uint32_t TMR4CMP1   : 32;           /*!< [31..0] Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR4CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE4;                       /*!< (@ 0x00000290) The mode register contains optional mode controls
                                                                    for the timer                                              */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR4TRIGSEL : 8;           /*!< [15..8] Counter/Timer 4 Trigger Source Selection                          */
            uint32_t            : 16;
    } MODE4_b;
  } ;

  union {
    __IOM uint32_t TMR4LMTVAL;                  /*!< (@ 0x00000294) This is an internal counter in the hardware that
                                                                    counts down from TMR_LMT to 1                              */

    struct {
      __IOM uint32_t TMR4LMTVAL : 8;            /*!< [7..0] Counter/Timer 4 Limit Readback                                     */
            uint32_t            : 24;
    } TMR4LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED8[2];

  union {
    __IOM uint32_t CTRL5;                       /*!< (@ 0x000002A0) This includes the Control bit fields for timer
                                                                    5.                                                         */

    struct {
      __IOM uint32_t TMR5EN     : 1;            /*!< [0..0] Counter/Timer 5 Enable bit.                                        */
      __IOM uint32_t TMR5CLR    : 1;            /*!< [1..1] Counter/Timer Clear bit.                                           */
      __IOM uint32_t TMR5POL0   : 1;            /*!< [2..2] Counter/Timer 5 output 0 polarity.                                 */
      __IOM uint32_t TMR5POL1   : 1;            /*!< [3..3] Counter/Timer 5 output 1 polarity.                                 */
      __IOM uint32_t TMR5FN     : 4;            /*!< [7..4] Counter/Timer 5 Function Select. For all Functions, CMP0
                                                     marks the end of timer cycle, and thus restarts the timer.                */
      __IOM uint32_t TMR5CLK    : 8;            /*!< [15..8] Counter/Timer 5 Clock Select.                                     */
      __IOM uint32_t TMR5TMODE  : 2;            /*!< [17..16] Counter/Timer 5 Trigger Mode                                     */
            uint32_t            : 6;
      __IOM uint32_t TMR5LMT    : 8;            /*!< [31..24] This field decides the number of iterations of Counter/Timer
                                                     5. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL5_b;
  } ;

  union {
    __IOM uint32_t TIMER5;                      /*!< (@ 0x000002A4) This register holds the running time or event
                                                                    count for timer 5.                                         */

