zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t TXCMPMIC   : 1;            /*!< [0..0] This bit holds the modem TXCMP interrupt clear.                    */
      __IOM uint32_t CTSMIC     : 1;            /*!< [1..1] This bit holds the nUARTCTS modem interrupt clear. Clears
                                                     the UARTCTSINTR interrupt.                                                */
      __IOM uint32_t DCDMIC     : 1;            /*!< [2..2] This bit holds the nUARTDCD modem interrupt clear. Clears
                                                     the UARTDCDINTR interrupt.                                                */
      __IOM uint32_t DSRMIC     : 1;            /*!< [3..3] This bit holds the nUARTDSR modem interrupt clear. Clears
                                                     the UARTDSRINTR interrupt.                                                */
      __IOM uint32_t RXIC       : 1;            /*!< [4..4] This bit holds the receive interrupt clear. Clears the
                                                     UARTRXINTR interrupt.                                                     */
      __IOM uint32_t TXIC       : 1;            /*!< [5..5] This bit holds the transmit interrupt clear. Clears the
                                                     UARTTXINTR interrupt.                                                     */
      __IOM uint32_t RTIC       : 1;            /*!< [6..6] This bit holds the receive timeout interrupt clear. Clears
                                                     the UARTRTINTR interrupt.                                                 */
      __IOM uint32_t FEIC       : 1;            /*!< [7..7] This bit holds the framing error interrupt clear. Clears
                                                     the UARTFEINTR interrupt.                                                 */
      __IOM uint32_t PEIC       : 1;            /*!< [8..8] This bit holds the parity error interrupt clear. Clears
                                                     the UARTPEINTR interrupt.                                                 */
      __IOM uint32_t BEIC       : 1;            /*!< [9..9] This bit holds the break error interrupt clear. Clears
                                                     the UARTBEINTR interrupt.                                                 */
      __IOM uint32_t OEIC       : 1;            /*!< [10..10] This bit holds the overrun interrupt clear. Clears
                                                     the UARTOEINTR interrupt.                                                 */
            uint32_t            : 21;
    } IEC_b;
  } ;
} UART0_Type;                                   /*!< Size = 72 (0x48)                                                          */



/* =========================================================================================================================== */
/* ================                                          USBPHY                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief USBPHY device register descriptions. (USBPHY)
  */

typedef struct {                                /*!< (@ 0x400B4000) USBPHY Structure                                           */

  union {
    __IOM uint32_t REG00;                       /*!< (@ 0x00000000) Register description here                                  */

    struct {
      __IOM uint32_t BF20       : 3;            /*!< [2..0] This bitfield is reserved.                                         */
      __IOM uint32_t BF43       : 2;            /*!< [4..3] BG observation enable signal. Active low. When enabled,
                                                     vref 400mV can be observed through USB0PP/USB0PN                          */
      __IOM uint32_t BF75       : 3;            /*!< [7..5] Manually set the Rx Clock phase select. These bits will
                                                     tune the HS RX path sample timing between digital and analog
                                                     inside PHY: 3'b000 represents the earliest phase 3'b111
                                                     represents the latest phase The delay associated with each
                                                     step is 256ps                                                             */
            uint32_t            : 24;
    } REG00_b;
  } ;

  union {
    __IOM uint32_t REG04;                       /*!< (@ 0x00000004) Register description here                                  */

    struct {
      __IOM uint32_t BF20       : 3;            /*!< [2..0] Manually set the Tx Clock phase select. These bits will
                                                     tune the HS TX path sample timing between digital and analog
                                                     inside PHY 3'b000 represents the earliest phase 3'b111
                                                     represents the latest phase The delay associated with each
                                                     step is 256ps                                                             */
      __IOM uint32_t BF43       : 2;            /*!< [4..3] Squelch detector bias current tuning, 2'b00 represents
                                                     the minimum bias current 2'b11 represents the maximum bias
                                                     current                                                                   */
      __IOM uint32_t BF55       : 1;            /*!< [5..5] This bitfield is reserved.                                         */
      __IOM uint32_t BF76       : 2;            /*!< [7..6] disconnect detector bias current tuning                            */
            uint32_t            : 24;
    } REG04_b;
  } ;

  union {
    __IOM uint32_t REG08;                       /*!< (@ 0x00000008) Register description here                                  */

