zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t BF30       : 4;            /*!< [3..0] 2'b00 represents the minimum bias current 2'b11 represents
                                                     the maximum bias current Rx squelch trigger point configures.
                                                     Allows tuning of the squelch trigger point in order to
                                                     compensate for package and board level parasitic. 4'b0000:112.5mV
                                                     4'b0001:150mV 4'b0010:87.5mV 4'b0011:162.5mV 4'b0100:100mV
                                                     4'b0101:137.5mV 4'b0110:75mV 4'b0111:150mV 4'b1000:125mV
                                                     4'b1001:162.5mV 4'b1010:100mV 4'b1011:175mV 4'b1100:150mV(default)
                                                     4'b1101:187.5mV 4'b1110:125mV 4'b1111:200mV                               */
      __IOM uint32_t BF64       : 3;            /*!< [6..4] HS eye height tuning 3'b000:400mV(default) 3'b001:475mV
                                                     3'b010:350mV 3'b011:500mV 3'b100:412.5mV 3'b101:425mV 3'b110:437.5mV
                                                     3'b111:450mV                                                              */
      __IOM uint32_t BF77       : 1;            /*!< [7..7] digital squelch filter select, this bit is used to filter
                                                     the glitch on the HS RX squelch signal. 1: 1 clock cycle
                                                     filter 0: 2 clock cycle fitter                                            */
            uint32_t            : 24;
    } REG08_b;
  } ;

  union {
    __IOM uint32_t REG0C;                       /*!< (@ 0x0000000C) Register description here                                  */

    struct {
      __IOM uint32_t BF10       : 2;            /*!< [1..0] BG output voltage reference adjust, normally these bits
                                                     are recommended to be kept as the default values. 00: standard
                                                     center level around 1.25v output, recommended 01: relative
                                                     higher output 1x: relative higher output                                  */
      __IOM uint32_t BF62       : 5;            /*!< [6..2] 45ohm HS ODT value tuning and FS/LS driver strength tuning
                                                     5'b11111: smallest HS ODT value and largest FS/LS driver
                                                     strength and fastest FS/LS slew rate 5'b10000: biggest
                                                     HS ODT value and smallest FS/LS driver strength and slowest
                                                     FS/LS slew rate                                                           */
      __IOM uint32_t BF77       : 1;            /*!< [7..7] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG0C_b;
  } ;

  union {
    __IOM uint32_t REG10;                       /*!< (@ 0x00000010) Register description here                                  */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] Bypass squelch trigger point configure in chirp modes
                                                     , active high, keep the default value is strongly recommended
                                                     . 1: Bypass squelch trigger point configure in chirp modes
                                                     , 0: squelch trigger point set to 250mV in chirp modes.                   */
      __IOM uint32_t BF11       : 1;            /*!< [1..1] Turn off LS/FS differential receiver in suspend mode,
                                                     active low 1: keep the LS/FS differential receiver , pin
                                                     fss_rxrcv will toggling according to the DP/DM state 0:
                                                     turn off the LS/FS differential receiver, pin fss_rxrcv
                                                     will not toggling according to the DP/DM state                            */
      __IOM uint32_t BF22       : 1;            /*!< [2..2] Half bit pre-emphasis enable. Active high 1: half bit
                                                     pre-emphasize mode, recommended 0: full bit pre-emphasize
                                                     mode                                                                      */
      __IOM uint32_t BF33       : 1;            /*!< [3..3] Single ended disconnect detection enable, active high.
                                                     1: enable Single ended disconnect detection 0: disenable
                                                     Single ended disconnect detection                                         */
      __IOM uint32_t BF74       : 4;            /*!< [7..4] HOST disconnect detection trigger point. Only valid in
                                                     host mode. Allows compensation for package and board level
                                                     parasitics which tend to drop in the input voltage. 4'b0000:625mV
                                                     4'b0001:675mV 4'b0010:612.5mV 4'b0011:575mV 4'b0100:550mV
                                                     4'b0101:600mV (default) 4'b0110:537.5mV 4'b0111:500mV 4'b1000:600mV
                                                     4'b1001:650mV 4'b1010:587.5mV 4'b1011:550mV 4'b1100:575mV
                                                     4'b1101:625mV 4'b1110:562.5mV 4'b1111:525mV                               */
            uint32_t            : 24;
    } REG10_b;
  } ;

  union {
    __IOM uint32_t REG14;                       /*!< (@ 0x00000014) Register description here                                  */

