zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t EP0OutIntStat : 1;         /*!< [0..0] OUT Endpoint 0 interrupt status. All interrupts are cleared
                                                     when the register is read.                                                */
      __IOM uint32_t EP1OutIntStat : 1;         /*!< [1..1] OUT Endpoint 1 interrupt status. All interrupts are cleared
                                                     when the register is read.                                                */
      __IOM uint32_t EP2OutIntStat : 1;         /*!< [2..2] OUT Endpoint 2 interrupt status. All interrupts are cleared
                                                     when the register is read.                                                */
      __IOM uint32_t EP3OutIntStat : 1;         /*!< [3..3] OUT Endpoint 3 interrupt status. All interrupts are cleared
                                                     when the register is read.                                                */
      __IOM uint32_t EP4OutIntStat : 1;         /*!< [4..4] OUT Endpoint 4 interrupt status. All interrupts are cleared
                                                     when the register is read.                                                */
      __IOM uint32_t EP5OutIntStat : 1;         /*!< [5..5] OUT Endpoint 5 interrupt status. All interrupts are cleared
                                                     when the register is read.                                                */
            uint32_t            : 10;
      __IOM uint32_t EP0InIntEn : 1;            /*!< [16..16] IN Endpoint 0 Interrupt Enable                                   */
      __IOM uint32_t EP1InIntEn : 1;            /*!< [17..17] IN Endpoint 1 Interrupt Enable                                   */
      __IOM uint32_t EP2InIntEn : 1;            /*!< [18..18] IN Endpoint 2 Interrupt Enable                                   */
      __IOM uint32_t EP3InIntEn : 1;            /*!< [19..19] IN Endpoint 3 Interrupt Enable                                   */
      __IOM uint32_t EP4InIntEn : 1;            /*!< [20..20] IN Endpoint 4 Interrupt Enable                                   */
      __IOM uint32_t EP5InIntEn : 1;            /*!< [21..21] IN Endpoint 5 Interrupt Enable                                   */
            uint32_t            : 10;
    } CFG1_b;
  } ;

  union {
    __IOM uint32_t CFG2;                        /*!< (@ 0x00000008) Provides interrupt enable and (currently active)
                                                                    status bits for each of the state interrupts,
                                                                    as well as the IN Endpoint and OUT Endpoint
                                                                    nterrupts. All active interrupts are cleared
                                                                    when this register is read. On reset, all
                                                                    IN and OUT Endpoint interrupts, in addition
                                                                    to Endpoint 0, are set to 1 while the remaining
                                                                    bits are set to 0.                                         */

    struct {
      __IOM uint32_t EP0OutIntEn : 1;           /*!< [0..0] Out Endpoint 0 Interrupt Enable.                                   */
      __IOM uint32_t EP1OutIntEn : 1;           /*!< [1..1] Out Endpoint 1 Interrupt Enable.                                   */
      __IOM uint32_t EP2OutIntEn : 1;           /*!< [2..2] Out Endpoint 2 Interrupt Enable.                                   */
      __IOM uint32_t EP3OutIntEn : 1;           /*!< [3..3] Out Endpoint 3 Interrupt Enable.                                   */
      __IOM uint32_t EP4OutIntEn : 1;           /*!< [4..4] Out Endpoint 4 Interrupt Enable.                                   */
      __IOM uint32_t EP5OutIntEn : 1;           /*!< [5..5] Out Endpoint 5 Interrupt Enable.                                   */
            uint32_t            : 10;
      __IOM uint32_t Suspend    : 1;            /*!< [16..16] Suspend Interrupt Status. Set when suspend signaling
                                                     is detected on the bus.                                                   */
      __IOM uint32_t Resume     : 1;            /*!< [17..17] Resume Interrupt Status. Set when resume signaling
                                                     is detected on the bus while the USB Controller is in Suspend
                                                     mode.                                                                     */
      __IOM uint32_t Reset      : 1;            /*!< [18..18] Reset Detect Interrupt Status. Set when reset signaling
                                                     is detected on the bus.                                                   */
      __IOM uint32_t SOF        : 1;            /*!< [19..19] Start of Frame Interrupt Status. Set at the start of
                                                     frame.                                                                    */
            uint32_t            : 4;
      __IOM uint32_t SuspendE   : 1;            /*!< [24..24] Suspend Interrupt Enable.                                        */
      __IOM uint32_t ResumeE    : 1;            /*!< [25..25] Resume Interrupt Enable.                                         */
      __IOM uint32_t ResetE     : 1;            /*!< [26..26] Reset Detect Interrupt Enable.                                   */
      __IOM uint32_t SOFE       : 1;            /*!< [27..27] Start of Frame interrupt enable.                                 */
            uint32_t            : 4;
    } CFG2_b;
  } ;

  union {
    __IOM uint32_t CFG3;                        /*!< (@ 0x0000000C) Provides Test fields to put the USB Controller
                                                                    into one of four test modes described in
                                                                    the USB 2.0 specification. Only one of the
                                                                    Test fields should be set at any time. (Not
                                                                    used in normal operation.) Also includes
                                                                    an index field that determines which endpoint
                                                                    control,status registers are accessed via
                                                                    the IDXn register fields, and a Frame field
                                                                    that holds the last received frame number.                 */

