zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
    struct {
      __IOM uint32_t DSP0INT    : 1;            /*!< [0..0] DSP0 Watchdog Timer Interrupt.                                     */
            uint32_t            : 31;
    } DSP0IERSTAT_b;
  } ;

  union {
    __IOM uint32_t DSP0IERCLR;                  /*!< (@ 0x00000218) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t DSP0INT    : 1;            /*!< [0..0] DSP0 Watchdog Timer Interrupt.                                     */
            uint32_t            : 31;
    } DSP0IERCLR_b;
  } ;

  union {
    __IOM uint32_t DSP0IERSET;                  /*!< (@ 0x0000021C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

    struct {
      __IOM uint32_t DSP0INT    : 1;            /*!< [0..0] DSP0 Watchdog Timer Interrupt.                                     */
            uint32_t            : 31;
    } DSP0IERSET_b;
  } ;

  union {
    __IOM uint32_t DSP1IEREN;                   /*!< (@ 0x00000220) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t DSP1INT    : 1;            /*!< [0..0] DSP0 Watchdog Timer Interrupt.                                     */
            uint32_t            : 31;
    } DSP1IEREN_b;
  } ;

  union {
    __IOM uint32_t DSP1IERSTAT;                 /*!< (@ 0x00000224) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

    struct {
      __IOM uint32_t DSP1INT    : 1;            /*!< [0..0] DSP0 Watchdog Timer Interrupt.                                     */
            uint32_t            : 31;
    } DSP1IERSTAT_b;
  } ;

  union {
    __IOM uint32_t DSP1IERCLR;                  /*!< (@ 0x00000228) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t DSP1INT    : 1;            /*!< [0..0] DSP0 Watchdog Timer Interrupt.                                     */
            uint32_t            : 31;
    } DSP1IERCLR_b;
  } ;

  union {
    __IOM uint32_t DSP1IERSET;                  /*!< (@ 0x0000022C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

    struct {
      __IOM uint32_t DSP1INT    : 1;            /*!< [0..0] DSP0 Watchdog Timer Interrupt.                                     */
            uint32_t            : 31;
    } DSP1IERSET_b;
  } ;
} WDT_Type;                                     /*!< Size = 560 (0x230)                                                        */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define ADC_BASE                    0x40038000UL
#define APBDMA_BASE                 0x40011000UL
#define AUDADC_BASE                 0x40210000UL
#define CLKGEN_BASE                 0x40004000UL
#define CPU_BASE                    0x48000000UL
#define CRYPTO_BASE                 0x400C0000UL
#define DC_BASE                     0x400A0000UL
#define DSI_BASE                    0x400A8000UL
#define DSP_BASE                    0x40100000UL
#define FPIO_BASE                   0x48001000UL
#define GPIO_BASE                   0x40010000UL
#define GPU_BASE                    0x40090000UL
#define I2S0_BASE                   0x40208000UL
#define I2S1_BASE                   0x40209000UL
#define IOM0_BASE                   0x40050000UL
#define IOM1_BASE                   0x40051000UL
#define IOM2_BASE                   0x40052000UL
#define IOM3_BASE                   0x40053000UL
#define IOM4_BASE                   0x40054000UL
#define IOM5_BASE                   0x40055000UL
#define IOM6_BASE                   0x40056000UL
#define IOM7_BASE                   0x40057000UL
#define IOSLAVE_BASE                0x40034000UL
#define MCUCTRL_BASE                0x40020000UL
#define MSPI0_BASE                  0x40060000UL
#define MSPI1_BASE                  0x40061000UL
#define MSPI2_BASE                  0x40062000UL
#define PDM0_BASE                   0x40201000UL
#define PDM1_BASE                   0x40202000UL
#define PDM2_BASE                   0x40203000UL
#define PDM3_BASE                   0x40204000UL
#define PWRCTRL_BASE                0x40021000UL
#define RSTGEN_BASE                 0x40000000UL
#define RTC_BASE                    0x40004800UL
#define SDIO_BASE                   0x40070000UL
#define SECURITY_BASE               0x40030000UL
#define STIMER_BASE                 0x40008800UL
#define TIMER_BASE                  0x40008000UL
#define UART0_BASE                  0x4001C000UL
#define UART1_BASE                  0x4001D000UL
#define UART2_BASE                  0x4001E000UL
#define UART3_BASE                  0x4001F000UL
#define USBPHY_BASE                 0x400B4000UL
#define USB_BASE                    0x400B0000UL
#define VCOMP_BASE                  0x4000C000UL
#define WDT_BASE                    0x40024000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define ADC                         ((ADC_Type*)               ADC_BASE)
#define APBDMA                      ((APBDMA_Type*)            APBDMA_BASE)
#define AUDADC                      ((AUDADC_Type*)            AUDADC_BASE)
#define CLKGEN                      ((CLKGEN_Type*)            CLKGEN_BASE)
#define CPU                         ((CPU_Type*)               CPU_BASE)
#define CRYPTO                      ((CRYPTO_Type*)            CRYPTO_BASE)
#define DC                          ((DC_Type*)                DC_BASE)
#define DSI                         ((DSI_Type*)               DSI_BASE)
#define DSP                         ((DSP_Type*)               DSP_BASE)
#define FPIO                        ((FPIO_Type*)              FPIO_BASE)
#define GPIO                        ((GPIO_Type*)              GPIO_BASE)
#define GPU                         ((GPU_Type*)               GPU_BASE)
#define I2S0                        ((I2S0_Type*)              I2S0_BASE)
#define I2S1                        ((I2S0_Type*)              I2S1_BASE)
#define IOM0                        ((IOM0_Type*)              IOM0_BASE)
#define IOM1                        ((IOM0_Type*)              IOM1_BASE)
#define IOM2                        ((IOM0_Type*)              IOM2_BASE)
#define IOM3                        ((IOM0_Type*)              IOM3_BASE)
#define IOM4                        ((IOM0_Type*)              IOM4_BASE)
#define IOM5                        ((IOM0_Type*)              IOM5_BASE)
#define IOM6                        ((IOM0_Type*)              IOM6_BASE)
#define IOM7                        ((IOM0_Type*)              IOM7_BASE)
#define IOSLAVE                     ((IOSLAVE_Type*)           IOSLAVE_BASE)
#define MCUCTRL                     ((MCUCTRL_Type*)           MCUCTRL_BASE)
#define MSPI0                       ((MSPI0_Type*)             MSPI0_BASE)
#define MSPI1                       ((MSPI0_Type*)             MSPI1_BASE)
#define MSPI2                       ((MSPI0_Type*)             MSPI2_BASE)
#define PDM0                        ((PDM0_Type*)              PDM0_BASE)
#define PDM1                        ((PDM0_Type*)              PDM1_BASE)
#define PDM2                        ((PDM0_Type*)              PDM2_BASE)
#define PDM3                        ((PDM0_Type*)              PDM3_BASE)
#define PWRCTRL                     ((PWRCTRL_Type*)           PWRCTRL_BASE)
#define RSTGEN                      ((RSTGEN_Type*)            RSTGEN_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define SDIO                        ((SDIO_Type*)              SDIO_BASE)
#define SECURITY                    ((SECURITY_Type*)          SECURITY_BASE)
#define STIMER                      ((STIMER_Type*)            STIMER_BASE)
#define TIMER                       ((TIMER_Type*)             TIMER_BASE)
#define UART0                       ((UART0_Type*)             UART0_BASE)
#define UART1                       ((UART0_Type*)             UART1_BASE)
#define UART2                       ((UART0_Type*)             UART2_BASE)
#define UART3                       ((UART0_Type*)             UART3_BASE)
#define USBPHY                      ((USBPHY_Type*)            USBPHY_BASE)
#define USB                         ((USB_Type*)               USB_BASE)
#define VCOMP                       ((VCOMP_Type*)             VCOMP_BASE)
#define WDT                         ((WDT_Type*)               WDT_BASE)

