zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
#define AUDADC_DMATARGADDR_LTARGADDR_Pos  (0UL)                     /*!< LTARGADDR (Bit 0)                                     */
#define AUDADC_DMATARGADDR_LTARGADDR_Msk  (0xfffffffUL)             /*!< LTARGADDR (Bitfield-Mask: 0xfffffff)                  */
/* ========================================================  DMASTAT  ======================================================== */
#define AUDADC_DMASTAT_DMAERR_Pos         (2UL)                     /*!< DMAERR (Bit 2)                                        */
#define AUDADC_DMASTAT_DMAERR_Msk         (0x4UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMASTAT_DMACPL_Pos         (1UL)                     /*!< DMACPL (Bit 1)                                        */
#define AUDADC_DMASTAT_DMACPL_Msk         (0x2UL)                   /*!< DMACPL (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMASTAT_DMATIP_Pos         (0UL)                     /*!< DMATIP (Bit 0)                                        */
#define AUDADC_DMASTAT_DMATIP_Msk         (0x1UL)                   /*!< DMATIP (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  OCTRL  ========================================================= */
#define CLKGEN_OCTRL_OSEL_Pos             (7UL)                     /*!< OSEL (Bit 7)                                          */
#define CLKGEN_OCTRL_OSEL_Msk             (0x80UL)                  /*!< OSEL (Bitfield-Mask: 0x01)                            */
/* ========================================================  CLKOUT  ========================================================= */
#define CLKGEN_CLKOUT_CKEN_Pos            (7UL)                     /*!< CKEN (Bit 7)                                          */
#define CLKGEN_CLKOUT_CKEN_Msk            (0x80UL)                  /*!< CKEN (Bitfield-Mask: 0x01)                            */
#define CLKGEN_CLKOUT_CKSEL_Pos           (0UL)                     /*!< CKSEL (Bit 0)                                         */
#define CLKGEN_CLKOUT_CKSEL_Msk           (0x3fUL)                  /*!< CKSEL (Bitfield-Mask: 0x3f)                           */
/* =========================================================  HFADJ  ========================================================= */
#define CLKGEN_HFADJ_HFADJMAXDELTA_Pos    (24UL)                    /*!< HFADJMAXDELTA (Bit 24)                                */
#define CLKGEN_HFADJ_HFADJMAXDELTA_Msk    (0x1f000000UL)            /*!< HFADJMAXDELTA (Bitfield-Mask: 0x1f)                   */
#define CLKGEN_HFADJ_HFADJGAIN_Pos        (21UL)                    /*!< HFADJGAIN (Bit 21)                                    */
#define CLKGEN_HFADJ_HFADJGAIN_Msk        (0xe00000UL)              /*!< HFADJGAIN (Bitfield-Mask: 0x07)                       */
#define CLKGEN_HFADJ_HFWARMUP_Pos         (20UL)                    /*!< HFWARMUP (Bit 20)                                     */
#define CLKGEN_HFADJ_HFWARMUP_Msk         (0x100000UL)              /*!< HFWARMUP (Bitfield-Mask: 0x01)                        */
#define CLKGEN_HFADJ_HFXTADJ_Pos          (8UL)                     /*!< HFXTADJ (Bit 8)                                       */
#define CLKGEN_HFADJ_HFXTADJ_Msk          (0xfff00UL)               /*!< HFXTADJ (Bitfield-Mask: 0xfff)                        */
#define CLKGEN_HFADJ_HFADJCK_Pos          (1UL)                     /*!< HFADJCK (Bit 1)                                       */
#define CLKGEN_HFADJ_HFADJCK_Msk          (0xeUL)                   /*!< HFADJCK (Bitfield-Mask: 0x07)                         */
#define CLKGEN_HFADJ_HFADJEN_Pos          (0UL)                     /*!< HFADJEN (Bit 0)                                       */
#define CLKGEN_HFADJ_HFADJEN_Msk          (0x1UL)                   /*!< HFADJEN (Bitfield-Mask: 0x01)                         */
/* ======================================================  CLOCKENSTAT  ====================================================== */
#define CLKGEN_CLOCKENSTAT_CLOCKENSTAT_Pos (0UL)                    /*!< CLOCKENSTAT (Bit 0)                                   */
#define CLKGEN_CLOCKENSTAT_CLOCKENSTAT_Msk (0xffffffffUL)           /*!< CLOCKENSTAT (Bitfield-Mask: 0xffffffff)               */
/* =====================================================  CLOCKEN2STAT  ====================================================== */
#define CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_Pos (0UL)                  /*!< CLOCKEN2STAT (Bit 0)                                  */
#define CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_Msk (0xffffffffUL)         /*!< CLOCKEN2STAT (Bitfield-Mask: 0xffffffff)              */
/* =====================================================  CLOCKEN3STAT  ====================================================== */
#define CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_Pos (0UL)                  /*!< CLOCKEN3STAT (Bit 0)                                  */
#define CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_Msk (0xffffffffUL)         /*!< CLOCKEN3STAT (Bitfield-Mask: 0xffffffff)              */
/* =========================================================  MISC  ========================================================== */
#define CLKGEN_MISC_CLKGENMISCSPARE_Pos   (25UL)                    /*!< CLKGENMISCSPARE (Bit 25)                              */
#define CLKGEN_MISC_CLKGENMISCSPARE_Msk   (0x2000000UL)             /*!< CLKGENMISCSPARE (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_HFRC96TRUNKGATE_Pos   (24UL)                    /*!< HFRC96TRUNKGATE (Bit 24)                              */
#define CLKGEN_MISC_HFRC96TRUNKGATE_Msk   (0x1000000UL)             /*!< HFRC96TRUNKGATE (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_HFRCFUNCCLKGATEEN_Pos (23UL)                    /*!< HFRCFUNCCLKGATEEN (Bit 23)                            */
#define CLKGEN_MISC_HFRCFUNCCLKGATEEN_Msk (0x800000UL)              /*!< HFRCFUNCCLKGATEEN (Bitfield-Mask: 0x01)               */
#define CLKGEN_MISC_ETMTRACECLKCLKGATEEN_Pos (22UL)                 /*!< ETMTRACECLKCLKGATEEN (Bit 22)                         */
#define CLKGEN_MISC_ETMTRACECLKCLKGATEEN_Msk (0x400000UL)           /*!< ETMTRACECLKCLKGATEEN (Bitfield-Mask: 0x01)            */
#define CLKGEN_MISC_APBDMACPUCLKCLKGATEEN_Pos (21UL)                /*!< APBDMACPUCLKCLKGATEEN (Bit 21)                        */
#define CLKGEN_MISC_APBDMACPUCLKCLKGATEEN_Msk (0x200000UL)          /*!< APBDMACPUCLKCLKGATEEN (Bitfield-Mask: 0x01)           */
#define CLKGEN_MISC_GFXAXICLKCLKGATEEN_Pos (20UL)                   /*!< GFXAXICLKCLKGATEEN (Bit 20)                           */
#define CLKGEN_MISC_GFXAXICLKCLKGATEEN_Msk (0x100000UL)             /*!< GFXAXICLKCLKGATEEN (Bitfield-Mask: 0x01)              */
#define CLKGEN_MISC_GFXCLKCLKGATEEN_Pos   (19UL)                    /*!< GFXCLKCLKGATEEN (Bit 19)                              */
#define CLKGEN_MISC_GFXCLKCLKGATEEN_Msk   (0x80000UL)               /*!< GFXCLKCLKGATEEN (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_CM4DAXICLKGATEEN_Pos  (18UL)                    /*!< CM4DAXICLKGATEEN (Bit 18)                             */
#define CLKGEN_MISC_CM4DAXICLKGATEEN_Msk  (0x40000UL)               /*!< CM4DAXICLKGATEEN (Bitfield-Mask: 0x01)                */
#define CLKGEN_MISC_PWRONCLKENUSBREFCLK_Pos (17UL)                  /*!< PWRONCLKENUSBREFCLK (Bit 17)                          */
#define CLKGEN_MISC_PWRONCLKENUSBREFCLK_Msk (0x20000UL)             /*!< PWRONCLKENUSBREFCLK (Bitfield-Mask: 0x01)             */
#define CLKGEN_MISC_PWRONCLKENI2S1REFCLK_Pos (16UL)                 /*!< PWRONCLKENI2S1REFCLK (Bit 16)                         */
#define CLKGEN_MISC_PWRONCLKENI2S1REFCLK_Msk (0x10000UL)            /*!< PWRONCLKENI2S1REFCLK (Bitfield-Mask: 0x01)            */
#define CLKGEN_MISC_PWRONCLKENI2S0REFCLK_Pos (15UL)                 /*!< PWRONCLKENI2S0REFCLK (Bit 15)                         */
#define CLKGEN_MISC_PWRONCLKENI2S0REFCLK_Msk (0x8000UL)             /*!< PWRONCLKENI2S0REFCLK (Bitfield-Mask: 0x01)            */
#define CLKGEN_MISC_AXIXACLKENOVRRIDE_Pos (14UL)                    /*!< AXIXACLKENOVRRIDE (Bit 14)                            */
#define CLKGEN_MISC_AXIXACLKENOVRRIDE_Msk (0x4000UL)                /*!< AXIXACLKENOVRRIDE (Bitfield-Mask: 0x01)               */
#define CLKGEN_MISC_PWRONCLKENI2S1_Pos    (13UL)                    /*!< PWRONCLKENI2S1 (Bit 13)                               */
#define CLKGEN_MISC_PWRONCLKENI2S1_Msk    (0x2000UL)                /*!< PWRONCLKENI2S1 (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_PWRONCLKENI2S0_Pos    (12UL)                    /*!< PWRONCLKENI2S0 (Bit 12)                               */
#define CLKGEN_MISC_PWRONCLKENI2S0_Msk    (0x1000UL)                /*!< PWRONCLKENI2S0 (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_PWRONCLKENCRYPTO_Pos  (11UL)                    /*!< PWRONCLKENCRYPTO (Bit 11)                             */
#define CLKGEN_MISC_PWRONCLKENCRYPTO_Msk  (0x800UL)                 /*!< PWRONCLKENCRYPTO (Bitfield-Mask: 0x01)                */
#define CLKGEN_MISC_PWRONCLKENSDIO_Pos    (10UL)                    /*!< PWRONCLKENSDIO (Bit 10)                               */
#define CLKGEN_MISC_PWRONCLKENSDIO_Msk    (0x400UL)                 /*!< PWRONCLKENSDIO (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_PWRONCLKENUSB_Pos     (9UL)                     /*!< PWRONCLKENUSB (Bit 9)                                 */
#define CLKGEN_MISC_PWRONCLKENUSB_Msk     (0x200UL)                 /*!< PWRONCLKENUSB (Bitfield-Mask: 0x01)                   */
#define CLKGEN_MISC_PWRONCLKENGFX_Pos     (8UL)                     /*!< PWRONCLKENGFX (Bit 8)                                 */
#define CLKGEN_MISC_PWRONCLKENGFX_Msk     (0x100UL)                 /*!< PWRONCLKENGFX (Bitfield-Mask: 0x01)                   */
#define CLKGEN_MISC_PWRONCLKENDISPPHY_Pos (7UL)                     /*!< PWRONCLKENDISPPHY (Bit 7)                             */
#define CLKGEN_MISC_PWRONCLKENDISPPHY_Msk (0x80UL)                  /*!< PWRONCLKENDISPPHY (Bitfield-Mask: 0x01)               */
#define CLKGEN_MISC_PWRONCLKENDISP_Pos    (6UL)                     /*!< PWRONCLKENDISP (Bit 6)                                */
#define CLKGEN_MISC_PWRONCLKENDISP_Msk    (0x40UL)                  /*!< PWRONCLKENDISP (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_FRCHFRC2_Pos          (5UL)                     /*!< FRCHFRC2 (Bit 5)                                      */
#define CLKGEN_MISC_FRCHFRC2_Msk          (0x20UL)                  /*!< FRCHFRC2 (Bitfield-Mask: 0x01)                        */
#define CLKGEN_MISC_USEHFRC2FQ192MHZ_Pos  (4UL)                     /*!< USEHFRC2FQ192MHZ (Bit 4)                              */
#define CLKGEN_MISC_USEHFRC2FQ192MHZ_Msk  (0x10UL)                  /*!< USEHFRC2FQ192MHZ (Bitfield-Mask: 0x01)                */
#define CLKGEN_MISC_USEHFRC2FQ96MHZ_Pos   (3UL)                     /*!< USEHFRC2FQ96MHZ (Bit 3)                               */
#define CLKGEN_MISC_USEHFRC2FQ96MHZ_Msk   (0x8UL)                   /*!< USEHFRC2FQ96MHZ (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_USEHFRC2FQ48MHZ_Pos   (2UL)                     /*!< USEHFRC2FQ48MHZ (Bit 2)                               */
#define CLKGEN_MISC_USEHFRC2FQ48MHZ_Msk   (0x4UL)                   /*!< USEHFRC2FQ48MHZ (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_FRCBURSTOFF_Pos       (1UL)                     /*!< FRCBURSTOFF (Bit 1)                                   */
#define CLKGEN_MISC_FRCBURSTOFF_Msk       (0x2UL)                   /*!< FRCBURSTOFF (Bitfield-Mask: 0x01)                     */
#define CLKGEN_MISC_FRCHFRC_Pos           (0UL)                     /*!< FRCHFRC (Bit 0)                                       */
#define CLKGEN_MISC_FRCHFRC_Msk           (0x1UL)                   /*!< FRCHFRC (Bitfield-Mask: 0x01)                         */
/* ========================================================  HF2ADJ0  ======================================================== */
#define CLKGEN_HF2ADJ0_HF2ADJXTHSMUXSEL_Pos (29UL)                  /*!< HF2ADJXTHSMUXSEL (Bit 29)                             */
#define CLKGEN_HF2ADJ0_HF2ADJXTHSMUXSEL_Msk (0x20000000UL)          /*!< HF2ADJXTHSMUXSEL (Bitfield-Mask: 0x01)                */
#define CLKGEN_HF2ADJ0_HF2ADJCNTINOFFSET_Pos (15UL)                 /*!< HF2ADJCNTINOFFSET (Bit 15)                            */
#define CLKGEN_HF2ADJ0_HF2ADJCNTINOFFSET_Msk (0x1fff8000UL)         /*!< HF2ADJCNTINOFFSET (Bitfield-Mask: 0x3fff)             */
#define CLKGEN_HF2ADJ0_HF2ADJFASTSTRDLY_Pos (2UL)                   /*!< HF2ADJFASTSTRDLY (Bit 2)                              */
#define CLKGEN_HF2ADJ0_HF2ADJFASTSTRDLY_Msk (0x7ffcUL)              /*!< HF2ADJFASTSTRDLY (Bitfield-Mask: 0x1fff)              */
#define CLKGEN_HF2ADJ0_HF2ADJFASTSTREN_Pos (1UL)                    /*!< HF2ADJFASTSTREN (Bit 1)                               */
#define CLKGEN_HF2ADJ0_HF2ADJFASTSTREN_Msk (0x2UL)                  /*!< HF2ADJFASTSTREN (Bitfield-Mask: 0x01)                 */
#define CLKGEN_HF2ADJ0_HF2ADJEN_Pos       (0UL)                     /*!< HF2ADJEN (Bit 0)                                      */
#define CLKGEN_HF2ADJ0_HF2ADJEN_Msk       (0x1UL)                   /*!< HF2ADJEN (Bitfield-Mask: 0x01)                        */
/* ========================================================  HF2ADJ1  ======================================================== */
#define CLKGEN_HF2ADJ1_HF2ADJTRIMOFFSET_Pos (3UL)                   /*!< HF2ADJTRIMOFFSET (Bit 3)                              */
#define CLKGEN_HF2ADJ1_HF2ADJTRIMOFFSET_Msk (0x3ff8UL)              /*!< HF2ADJTRIMOFFSET (Bitfield-Mask: 0x7ff)               */
#define CLKGEN_HF2ADJ1_HF2ADJTRIMEN_Pos   (0UL)                     /*!< HF2ADJTRIMEN (Bit 0)                                  */
#define CLKGEN_HF2ADJ1_HF2ADJTRIMEN_Msk   (0x7UL)                   /*!< HF2ADJTRIMEN (Bitfield-Mask: 0x07)                    */
/* ========================================================  HF2ADJ2  ======================================================== */
#define CLKGEN_HF2ADJ2_HF2ADJRATIO_Pos    (2UL)                     /*!< HF2ADJRATIO (Bit 2)                                   */
#define CLKGEN_HF2ADJ2_HF2ADJRATIO_Msk    (0x7ffffffcUL)            /*!< HF2ADJRATIO (Bitfield-Mask: 0x1fffffff)               */
#define CLKGEN_HF2ADJ2_HF2ADJXTALDIVRATIO_Pos (0UL)                 /*!< HF2ADJXTALDIVRATIO (Bit 0)                            */
#define CLKGEN_HF2ADJ2_HF2ADJXTALDIVRATIO_Msk (0x3UL)               /*!< HF2ADJXTALDIVRATIO (Bitfield-Mask: 0x03)              */
/* ========================================================  HF2VAL  ========================================================= */
#define CLKGEN_HF2VAL_HF2ADJTRIMOUT_Pos   (0UL)                     /*!< HF2ADJTRIMOUT (Bit 0)                                 */
#define CLKGEN_HF2VAL_HF2ADJTRIMOUT_Msk   (0x7ffUL)                 /*!< HF2ADJTRIMOUT (Bitfield-Mask: 0x7ff)                  */
/* =======================================================  LFRCCTRL  ======================================================== */
#define CLKGEN_LFRCCTRL_LFRCPWD_Pos       (1UL)                     /*!< LFRCPWD (Bit 1)                                       */
#define CLKGEN_LFRCCTRL_LFRCPWD_Msk       (0x2UL)                   /*!< LFRCPWD (Bitfield-Mask: 0x01)                         */
#define CLKGEN_LFRCCTRL_LFRCOUT_Pos       (0UL)                     /*!< LFRCOUT (Bit 0)                                       */
#define CLKGEN_LFRCCTRL_LFRCOUT_Msk       (0x1UL)                   /*!< LFRCOUT (Bitfield-Mask: 0x01)                         */
/* ======================================================  DISPCLKCTRL  ====================================================== */
#define CLKGEN_DISPCLKCTRL_DCCLKEN_Pos    (7UL)                     /*!< DCCLKEN (Bit 7)                                       */
#define CLKGEN_DISPCLKCTRL_DCCLKEN_Msk    (0x80UL)                  /*!< DCCLKEN (Bitfield-Mask: 0x01)                         */
#define CLKGEN_DISPCLKCTRL_DISPCLKSEL_Pos (4UL)                     /*!< DISPCLKSEL (Bit 4)                                    */
#define CLKGEN_DISPCLKCTRL_DISPCLKSEL_Msk (0x30UL)                  /*!< DISPCLKSEL (Bitfield-Mask: 0x03)                      */
#define CLKGEN_DISPCLKCTRL_PLLCLKEN_Pos   (3UL)                     /*!< PLLCLKEN (Bit 3)                                      */
#define CLKGEN_DISPCLKCTRL_PLLCLKEN_Msk   (0x8UL)                   /*!< PLLCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_DISPCLKCTRL_PLLCLKSEL_Pos  (0UL)                     /*!< PLLCLKSEL (Bit 0)                                     */
#define CLKGEN_DISPCLKCTRL_PLLCLKSEL_Msk  (0x3UL)                   /*!< PLLCLKSEL (Bitfield-Mask: 0x03)                       */
/* =====================================================  CLKGENSPARES  ====================================================== */
#define CLKGEN_CLKGENSPARES_CLKGENSPARES_Pos (0UL)                  /*!< CLKGENSPARES (Bit 0)                                  */
#define CLKGEN_CLKGENSPARES_CLKGENSPARES_Msk (0xffffffffUL)         /*!< CLKGENSPARES (Bitfield-Mask: 0xffffffff)              */
/* ===================================================  HFRCIDLECOUNTERS  ==================================================== */
#define CLKGEN_HFRCIDLECOUNTERS_UPDATEENABLE_Pos (31UL)             /*!< UPDATEENABLE (Bit 31)                                 */
#define CLKGEN_HFRCIDLECOUNTERS_UPDATEENABLE_Msk (0x80000000UL)     /*!< UPDATEENABLE (Bitfield-Mask: 0x01)                    */
#define CLKGEN_HFRCIDLECOUNTERS_HFRC2CLKREQDELAY_Pos (24UL)         /*!< HFRC2CLKREQDELAY (Bit 24)                             */
#define CLKGEN_HFRCIDLECOUNTERS_HFRC2CLKREQDELAY_Msk (0x3f000000UL) /*!< HFRC2CLKREQDELAY (Bitfield-Mask: 0x3f)                */
#define CLKGEN_HFRCIDLECOUNTERS_HFRC2PWRDOWNDELAY_Pos (16UL)        /*!< HFRC2PWRDOWNDELAY (Bit 16)                            */
#define CLKGEN_HFRCIDLECOUNTERS_HFRC2PWRDOWNDELAY_Msk (0x3f0000UL)  /*!< HFRC2PWRDOWNDELAY (Bitfield-Mask: 0x3f)               */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCCLKREQDELAY_Pos (8UL)           /*!< HFRCCLKREQDELAY (Bit 8)                               */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCCLKREQDELAY_Msk (0x3f00UL)      /*!< HFRCCLKREQDELAY (Bitfield-Mask: 0x3f)                 */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCPWRDOWNDELAY_Pos (0UL)          /*!< HFRCPWRDOWNDELAY (Bit 0)                              */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCPWRDOWNDELAY_Msk (0x3fUL)       /*!< HFRCPWRDOWNDELAY (Bitfield-Mask: 0x3f)                */
/* =======================================================  INTRPTEN  ======================================================== */
#define CLKGEN_INTRPTEN_OF_Pos            (0UL)                     /*!< OF (Bit 0)                                            */
#define CLKGEN_INTRPTEN_OF_Msk            (0x1UL)                   /*!< OF (Bitfield-Mask: 0x01)                              */
/* ======================================================  INTRPTSTAT  ======================================================= */
#define CLKGEN_INTRPTSTAT_OF_Pos          (0UL)                     /*!< OF (Bit 0)                                            */
#define CLKGEN_INTRPTSTAT_OF_Msk          (0x1UL)                   /*!< OF (Bitfield-Mask: 0x01)                              */
/* =======================================================  INTRPTCLR  ======================================================= */
#define CLKGEN_INTRPTCLR_OF_Pos           (0UL)                     /*!< OF (Bit 0)                                            */
#define CLKGEN_INTRPTCLR_OF_Msk           (0x1UL)                   /*!< OF (Bitfield-Mask: 0x01)                              */
/* =======================================================  INTRPTSET  ======================================================= */
#define CLKGEN_INTRPTSET_OF_Pos           (0UL)                     /*!< OF (Bit 0)                                            */
#define CLKGEN_INTRPTSET_OF_Msk           (0x1UL)                   /*!< OF (Bitfield-Mask: 0x01)                              */


/* =========================================================================================================================== */
/* ================                                            CPU                                            ================ */
/* =========================================================================================================================== */

