zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
#define DC_LAYER3STRIDE_LAYER3STRIDEDIST_Msk (0xffffUL)             /*!< LAYER3STRIDEDIST (Bitfield-Mask: 0xffff)              */
/* ======================================================  LAYER3RESXY  ====================================================== */
#define DC_LAYER3RESXY_LAYER3PIXRESX_Pos  (16UL)                    /*!< LAYER3PIXRESX (Bit 16)                                */
#define DC_LAYER3RESXY_LAYER3PIXRESX_Msk  (0xffff0000UL)            /*!< LAYER3PIXRESX (Bitfield-Mask: 0xffff)                 */
#define DC_LAYER3RESXY_LAYER3PIXRESY_Pos  (0UL)                     /*!< LAYER3PIXRESY (Bit 0)                                 */
#define DC_LAYER3RESXY_LAYER3PIXRESY_Msk  (0xffffUL)                /*!< LAYER3PIXRESY (Bitfield-Mask: 0xffff)                 */
/* =====================================================  LAYER3SCALEX  ====================================================== */
#define DC_LAYER3SCALEX_LAYER3XFACTOR_Pos (0UL)                     /*!< LAYER3XFACTOR (Bit 0)                                 */
#define DC_LAYER3SCALEX_LAYER3XFACTOR_Msk (0xffffffffUL)            /*!< LAYER3XFACTOR (Bitfield-Mask: 0xffffffff)             */
/* =====================================================  LAYER3SCALEY  ====================================================== */
#define DC_LAYER3SCALEY_LAYER3YFACTOR_Pos (0UL)                     /*!< LAYER3YFACTOR (Bit 0)                                 */
#define DC_LAYER3SCALEY_LAYER3YFACTOR_Msk (0xffffffffUL)            /*!< LAYER3YFACTOR (Bitfield-Mask: 0xffffffff)             */
/* ========================================================  DBICMD  ========================================================= */
#define DC_DBICMD_RSVD2_Pos               (31UL)                    /*!< RSVD2 (Bit 31)                                        */
#define DC_DBICMD_RSVD2_Msk               (0x80000000UL)            /*!< RSVD2 (Bitfield-Mask: 0x01)                           */
#define DC_DBICMD_DIRECTDATA_Pos          (30UL)                    /*!< DIRECTDATA (Bit 30)                                   */
#define DC_DBICMD_DIRECTDATA_Msk          (0x40000000UL)            /*!< DIRECTDATA (Bitfield-Mask: 0x01)                      */
#define DC_DBICMD_RSVD1_Pos               (29UL)                    /*!< RSVD1 (Bit 29)                                        */
#define DC_DBICMD_RSVD1_Msk               (0x20000000UL)            /*!< RSVD1 (Bitfield-Mask: 0x01)                           */
#define DC_DBICMD_READDBI_Pos             (28UL)                    /*!< READDBI (Bit 28)                                      */
#define DC_DBICMD_READDBI_Msk             (0x10000000UL)            /*!< READDBI (Bitfield-Mask: 0x01)                         */
#define DC_DBICMD_LOCALSTORE_Pos          (27UL)                    /*!< LOCALSTORE (Bit 27)                                   */
#define DC_DBICMD_LOCALSTORE_Msk          (0x8000000UL)             /*!< LOCALSTORE (Bitfield-Mask: 0x01)                      */
#define DC_DBICMD_RSVD0_Pos               (16UL)                    /*!< RSVD0 (Bit 16)                                        */
#define DC_DBICMD_RSVD0_Msk               (0x7ff0000UL)             /*!< RSVD0 (Bitfield-Mask: 0x7ff)                          */
#define DC_DBICMD_DATA2DBI_Pos            (0UL)                     /*!< DATA2DBI (Bit 0)                                      */
#define DC_DBICMD_DATA2DBI_Msk            (0xffffUL)                /*!< DATA2DBI (Bitfield-Mask: 0xffff)                      */
/* ========================================================  DBIRDAT  ======================================================== */
#define DC_DBIRDAT_READTYPEB_Pos          (0UL)                     /*!< READTYPEB (Bit 0)                                     */
#define DC_DBIRDAT_READTYPEB_Msk          (0xffffffffUL)            /*!< READTYPEB (Bitfield-Mask: 0xffffffff)                 */
/* =========================================================  CONFG  ========================================================= */
#define DC_CONFG_RSVD_Pos                 (24UL)                    /*!< RSVD (Bit 24)                                         */
#define DC_CONFG_RSVD_Msk                 (0xff000000UL)            /*!< RSVD (Bitfield-Mask: 0xff)                            */
#define DC_CONFG_CFGLAYER3GAMMALUT_Pos    (23UL)                    /*!< CFGLAYER3GAMMALUT (Bit 23)                            */
#define DC_CONFG_CFGLAYER3GAMMALUT_Msk    (0x800000UL)              /*!< CFGLAYER3GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_CFGLAYER3SCALAR_Pos      (22UL)                    /*!< CFGLAYER3SCALAR (Bit 22)                              */
#define DC_CONFG_CFGLAYER3SCALAR_Msk      (0x400000UL)              /*!< CFGLAYER3SCALAR (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER3BLENDER_Pos     (21UL)                    /*!< CFGLAYER3BLENDER (Bit 21)                             */
#define DC_CONFG_CFGLAYER3BLENDER_Msk     (0x200000UL)              /*!< CFGLAYER3BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER3EN_Pos          (20UL)                    /*!< CFGLAYER3EN (Bit 20)                                  */
#define DC_CONFG_CFGLAYER3EN_Msk          (0x100000UL)              /*!< CFGLAYER3EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGLAYER2GAMMALUT_Pos    (19UL)                    /*!< CFGLAYER2GAMMALUT (Bit 19)                            */
#define DC_CONFG_CFGLAYER2GAMMALUT_Msk    (0x80000UL)               /*!< CFGLAYER2GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_CFGLAYER2SCALAR_Pos      (18UL)                    /*!< CFGLAYER2SCALAR (Bit 18)                              */
#define DC_CONFG_CFGLAYER2SCALAR_Msk      (0x40000UL)               /*!< CFGLAYER2SCALAR (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER2BLENDER_Pos     (17UL)                    /*!< CFGLAYER2BLENDER (Bit 17)                             */
#define DC_CONFG_CFGLAYER2BLENDER_Msk     (0x20000UL)               /*!< CFGLAYER2BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER2EN_Pos          (16UL)                    /*!< CFGLAYER2EN (Bit 16)                                  */
#define DC_CONFG_CFGLAYER2EN_Msk          (0x10000UL)               /*!< CFGLAYER2EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGLAYER1GAMMALUT_Pos    (15UL)                    /*!< CFGLAYER1GAMMALUT (Bit 15)                            */
#define DC_CONFG_CFGLAYER1GAMMALUT_Msk    (0x8000UL)                /*!< CFGLAYER1GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_CFGLAYER1SCALAR_Pos      (14UL)                    /*!< CFGLAYER1SCALAR (Bit 14)                              */
#define DC_CONFG_CFGLAYER1SCALAR_Msk      (0x4000UL)                /*!< CFGLAYER1SCALAR (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER1BLENDER_Pos     (13UL)                    /*!< CFGLAYER1BLENDER (Bit 13)                             */
#define DC_CONFG_CFGLAYER1BLENDER_Msk     (0x2000UL)                /*!< CFGLAYER1BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER1EN_Pos          (12UL)                    /*!< CFGLAYER1EN (Bit 12)                                  */
#define DC_CONFG_CFGLAYER1EN_Msk          (0x1000UL)                /*!< CFGLAYER1EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGLAYER0GAMMALUT_Pos    (11UL)                    /*!< CFGLAYER0GAMMALUT (Bit 11)                            */
#define DC_CONFG_CFGLAYER0GAMMALUT_Msk    (0x800UL)                 /*!< CFGLAYER0GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_CFGLAYER0SCALAR_Pos      (10UL)                    /*!< CFGLAYER0SCALAR (Bit 10)                              */
#define DC_CONFG_CFGLAYER0SCALAR_Msk      (0x400UL)                 /*!< CFGLAYER0SCALAR (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER0BLENDER_Pos     (9UL)                     /*!< CFGLAYER0BLENDER (Bit 9)                              */
#define DC_CONFG_CFGLAYER0BLENDER_Msk     (0x200UL)                 /*!< CFGLAYER0BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER0EN_Pos          (8UL)                     /*!< CFGLAYER0EN (Bit 8)                                   */
#define DC_CONFG_CFGLAYER0EN_Msk          (0x100UL)                 /*!< CFGLAYER0EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGRGB2YUVEN_Pos         (7UL)                     /*!< CFGRGB2YUVEN (Bit 7)                                  */
#define DC_CONFG_CFGRGB2YUVEN_Msk         (0x80UL)                  /*!< CFGRGB2YUVEN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGDBITYPEBEN_Pos        (6UL)                     /*!< CFGDBITYPEBEN (Bit 6)                                 */
#define DC_CONFG_CFGDBITYPEBEN_Msk        (0x40UL)                  /*!< CFGDBITYPEBEN (Bitfield-Mask: 0x01)                   */
#define DC_CONFG_CFGYUVCNVTEN_Pos         (5UL)                     /*!< CFGYUVCNVTEN (Bit 5)                                  */
#define DC_CONFG_CFGYUVCNVTEN_Msk         (0x20UL)                  /*!< CFGYUVCNVTEN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGFORMATTEN_Pos         (4UL)                     /*!< CFGFORMATTEN (Bit 4)                                  */
#define DC_CONFG_CFGFORMATTEN_Msk         (0x10UL)                  /*!< CFGFORMATTEN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGDITHEREN_Pos          (3UL)                     /*!< CFGDITHEREN (Bit 3)                                   */
#define DC_CONFG_CFGDITHEREN_Msk          (0x8UL)                   /*!< CFGDITHEREN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGPCURSOREN_Pos         (2UL)                     /*!< CFGPCURSOREN (Bit 2)                                  */
#define DC_CONFG_CFGPCURSOREN_Msk         (0x4UL)                   /*!< CFGPCURSOREN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGFCURSOREN_Pos         (1UL)                     /*!< CFGFCURSOREN (Bit 1)                                  */
#define DC_CONFG_CFGFCURSOREN_Msk         (0x2UL)                   /*!< CFGFCURSOREN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGGLBGAMMAEN_Pos        (0UL)                     /*!< CFGGLBGAMMAEN (Bit 0)                                 */
#define DC_CONFG_CFGGLBGAMMAEN_Msk        (0x1UL)                   /*!< CFGGLBGAMMAEN (Bitfield-Mask: 0x01)                   */
/* =========================================================  IDREG  ========================================================= */
#define DC_IDREG_DCID_Pos                 (0UL)                     /*!< DCID (Bit 0)                                          */
#define DC_IDREG_DCID_Msk                 (0xffffffffUL)            /*!< DCID (Bitfield-Mask: 0xffffffff)                      */
/* =======================================================  INTERRUPT  ======================================================= */
#define DC_INTERRUPT_INTTRIGGER_Pos       (31UL)                    /*!< INTTRIGGER (Bit 31)                                   */
#define DC_INTERRUPT_INTTRIGGER_Msk       (0x80000000UL)            /*!< INTTRIGGER (Bitfield-Mask: 0x01)                      */
#define DC_INTERRUPT_INTTEEN_Pos          (3UL)                     /*!< INTTEEN (Bit 3)                                       */
#define DC_INTERRUPT_INTTEEN_Msk          (0x8UL)                   /*!< INTTEEN (Bitfield-Mask: 0x01)                         */
#define DC_INTERRUPT_INTMMUERR_Pos        (2UL)                     /*!< INTMMUERR (Bit 2)                                     */
#define DC_INTERRUPT_INTMMUERR_Msk        (0x4UL)                   /*!< INTMMUERR (Bitfield-Mask: 0x01)                       */
#define DC_INTERRUPT_INTHSYNCEN_Pos       (1UL)                     /*!< INTHSYNCEN (Bit 1)                                    */
#define DC_INTERRUPT_INTHSYNCEN_Msk       (0x2UL)                   /*!< INTHSYNCEN (Bitfield-Mask: 0x01)                      */
#define DC_INTERRUPT_INTVSYNCEN_Pos       (0UL)                     /*!< INTVSYNCEN (Bit 0)                                    */
#define DC_INTERRUPT_INTVSYNCEN_Msk       (0x1UL)                   /*!< INTVSYNCEN (Bitfield-Mask: 0x01)                      */
/* ========================================================  STATUS  ========================================================= */
#define DC_STATUS_STATDBIPENDTRANS_Pos    (12UL)                    /*!< STATDBIPENDTRANS (Bit 12)                             */
#define DC_STATUS_STATDBIPENDTRANS_Msk    (0x1000UL)                /*!< STATDBIPENDTRANS (Bitfield-Mask: 0x01)                */
#define DC_STATUS_STATDBIPENDCOM_Pos      (11UL)                    /*!< STATDBIPENDCOM (Bit 11)                               */
#define DC_STATUS_STATDBIPENDCOM_Msk      (0x800UL)                 /*!< STATDBIPENDCOM (Bitfield-Mask: 0x01)                  */
#define DC_STATUS_STATDBIRGB_Pos          (10UL)                    /*!< STATDBIRGB (Bit 10)                                   */
#define DC_STATUS_STATDBIRGB_Msk          (0x400UL)                 /*!< STATDBIRGB (Bitfield-Mask: 0x01)                      */
#define DC_STATUS_STATTEAR_Pos            (8UL)                     /*!< STATTEAR (Bit 8)                                      */
#define DC_STATUS_STATTEAR_Msk            (0x100UL)                 /*!< STATTEAR (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_STATSTICKY_Pos          (7UL)                     /*!< STATSTICKY (Bit 7)                                    */
#define DC_STATUS_STATSTICKY_Msk          (0x80UL)                  /*!< STATSTICKY (Bitfield-Mask: 0x01)                      */
#define DC_STATUS_STATUF_Pos              (6UL)                     /*!< STATUF (Bit 6)                                        */
#define DC_STATUS_STATUF_Msk              (0x40UL)                  /*!< STATUF (Bitfield-Mask: 0x01)                          */
#define DC_STATUS_STATLAST_Pos            (5UL)                     /*!< STATLAST (Bit 5)                                      */
#define DC_STATUS_STATLAST_Msk            (0x20UL)                  /*!< STATLAST (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_STATCSYNC_Pos           (4UL)                     /*!< STATCSYNC (Bit 4)                                     */
#define DC_STATUS_STATCSYNC_Msk           (0x10UL)                  /*!< STATCSYNC (Bitfield-Mask: 0x01)                       */
#define DC_STATUS_STATVSYNC_Pos           (3UL)                     /*!< STATVSYNC (Bit 3)                                     */
#define DC_STATUS_STATVSYNC_Msk           (0x8UL)                   /*!< STATVSYNC (Bitfield-Mask: 0x01)                       */
#define DC_STATUS_STATHSYNC_Pos           (2UL)                     /*!< STATHSYNC (Bit 2)                                     */
#define DC_STATUS_STATHSYNC_Msk           (0x4UL)                   /*!< STATHSYNC (Bitfield-Mask: 0x01)                       */
#define DC_STATUS_STATDE_Pos              (1UL)                     /*!< STATDE (Bit 1)                                        */
#define DC_STATUS_STATDE_Msk              (0x2UL)                   /*!< STATDE (Bitfield-Mask: 0x01)                          */
#define DC_STATUS_STATNOTBLANK_Pos        (0UL)                     /*!< STATNOTBLANK (Bit 0)                                  */
#define DC_STATUS_STATNOTBLANK_Msk        (0x1UL)                   /*!< STATNOTBLANK (Bitfield-Mask: 0x01)                    */
/* ========================================================  COLMOD  ========================================================= */
#define DC_COLMOD_CLMDBKPRESSURE_Pos      (31UL)                    /*!< CLMDBKPRESSURE (Bit 31)                               */
#define DC_COLMOD_CLMDBKPRESSURE_Msk      (0x80000000UL)            /*!< CLMDBKPRESSURE (Bitfield-Mask: 0x01)                  */
#define DC_COLMOD_CLMDLVDS_Pos            (30UL)                    /*!< CLMDLVDS (Bit 30)                                     */
#define DC_COLMOD_CLMDLVDS_Msk            (0x40000000UL)            /*!< CLMDLVDS (Bitfield-Mask: 0x01)                        */
#define DC_COLMOD_CLMDJDI_Pos             (29UL)                    /*!< CLMDJDI (Bit 29)                                      */
#define DC_COLMOD_CLMDJDI_Msk             (0x20000000UL)            /*!< CLMDJDI (Bitfield-Mask: 0x01)                         */
#define DC_COLMOD_CLMDARGB4444_Pos        (22UL)                    /*!< CLMDARGB4444 (Bit 22)                                 */
#define DC_COLMOD_CLMDARGB4444_Msk        (0x400000UL)              /*!< CLMDARGB4444 (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_CLMDRGBA4444_Pos        (21UL)                    /*!< CLMDRGBA4444 (Bit 21)                                 */
#define DC_COLMOD_CLMDRGBA4444_Msk        (0x200000UL)              /*!< CLMDRGBA4444 (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_CLMDQPI_Pos             (20UL)                    /*!< CLMDQPI (Bit 20)                                      */
#define DC_COLMOD_CLMDQPI_Msk             (0x100000UL)              /*!< CLMDQPI (Bitfield-Mask: 0x01)                         */
#define DC_COLMOD_CLMDDBIBEXTCTRL_Pos     (19UL)                    /*!< CLMDDBIBEXTCTRL (Bit 19)                              */
#define DC_COLMOD_CLMDDBIBEXTCTRL_Msk     (0x80000UL)               /*!< CLMDDBIBEXTCTRL (Bitfield-Mask: 0x01)                 */
#define DC_COLMOD_CLMDTSC6_Pos            (18UL)                    /*!< CLMDTSC6 (Bit 18)                                     */
#define DC_COLMOD_CLMDTSC6_Msk            (0x40000UL)               /*!< CLMDTSC6 (Bitfield-Mask: 0x01)                        */
#define DC_COLMOD_CLMDTSC_Pos             (17UL)                    /*!< CLMDTSC (Bit 17)                                      */
#define DC_COLMOD_CLMDTSC_Msk             (0x20000UL)               /*!< CLMDTSC (Bitfield-Mask: 0x01)                         */
#define DC_COLMOD_CLMDLUT8_Pos            (16UL)                    /*!< CLMDLUT8 (Bit 16)                                     */
#define DC_COLMOD_CLMDLUT8_Msk            (0x10000UL)               /*!< CLMDLUT8 (Bitfield-Mask: 0x01)                        */
#define DC_COLMOD_CLMDRGBA5551_Pos        (15UL)                    /*!< CLMDRGBA5551 (Bit 15)                                 */
#define DC_COLMOD_CLMDRGBA5551_Msk        (0x8000UL)                /*!< CLMDRGBA5551 (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_CLMDRGBA8888_Pos        (14UL)                    /*!< CLMDRGBA8888 (Bit 14)                                 */
#define DC_COLMOD_CLMDRGBA8888_Msk        (0x4000UL)                /*!< CLMDRGBA8888 (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_CLMDRGB332_Pos          (13UL)                    /*!< CLMDRGB332 (Bit 13)                                   */
#define DC_COLMOD_CLMDRGB332_Msk          (0x2000UL)                /*!< CLMDRGB332 (Bitfield-Mask: 0x01)                      */
#define DC_COLMOD_CLMDRGB565_Pos          (12UL)                    /*!< CLMDRGB565 (Bit 12)                                   */
#define DC_COLMOD_CLMDRGB565_Msk          (0x1000UL)                /*!< CLMDRGB565 (Bitfield-Mask: 0x01)                      */
#define DC_COLMOD_CLMDARGB8888_Pos        (11UL)                    /*!< CLMDARGB8888 (Bit 11)                                 */
#define DC_COLMOD_CLMDARGB8888_Msk        (0x800UL)                 /*!< CLMDARGB8888 (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_CLMDL8_Pos              (10UL)                    /*!< CLMDL8 (Bit 10)                                       */
#define DC_COLMOD_CLMDL8_Msk              (0x400UL)                 /*!< CLMDL8 (Bitfield-Mask: 0x01)                          */
#define DC_COLMOD_CLMDL1_Pos              (9UL)                     /*!< CLMDL1 (Bit 9)                                        */
#define DC_COLMOD_CLMDL1_Msk              (0x200UL)                 /*!< CLMDL1 (Bitfield-Mask: 0x01)                          */
#define DC_COLMOD_CLMDL4_Pos              (8UL)                     /*!< CLMDL4 (Bit 8)                                        */
#define DC_COLMOD_CLMDL4_Msk              (0x100UL)                 /*!< CLMDL4 (Bitfield-Mask: 0x01)                          */
#define DC_COLMOD_CLMDYUYV_Pos            (7UL)                     /*!< CLMDYUYV (Bit 7)                                      */
#define DC_COLMOD_CLMDYUYV_Msk            (0x80UL)                  /*!< CLMDYUYV (Bitfield-Mask: 0x01)                        */
#define DC_COLMOD_CLMDRGB888_Pos          (6UL)                     /*!< CLMDRGB888 (Bit 6)                                    */
#define DC_COLMOD_CLMDRGB888_Msk          (0x40UL)                  /*!< CLMDRGB888 (Bitfield-Mask: 0x01)                      */
#define DC_COLMOD_CLMDYUY2_Pos            (5UL)                     /*!< CLMDYUY2 (Bit 5)                                      */
#define DC_COLMOD_CLMDYUY2_Msk            (0x20UL)                  /*!< CLMDYUY2 (Bitfield-Mask: 0x01)                        */
#define DC_COLMOD_CLMDABGR8888_Pos        (4UL)                     /*!< CLMDABGR8888 (Bit 4)                                  */
#define DC_COLMOD_CLMDABGR8888_Msk        (0x10UL)                  /*!< CLMDABGR8888 (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_CLMDBGRA8888_Pos        (3UL)                     /*!< CLMDBGRA8888 (Bit 3)                                  */
#define DC_COLMOD_CLMDBGRA8888_Msk        (0x8UL)                   /*!< CLMDBGRA8888 (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_CLMDVYUV420_Pos         (2UL)                     /*!< CLMDVYUV420 (Bit 2)                                   */
#define DC_COLMOD_CLMDVYUV420_Msk         (0x4UL)                   /*!< CLMDVYUV420 (Bitfield-Mask: 0x01)                     */
#define DC_COLMOD_CLMDTLYUV420_Pos        (1UL)                     /*!< CLMDTLYUV420 (Bit 1)                                  */
#define DC_COLMOD_CLMDTLYUV420_Msk        (0x2UL)                   /*!< CLMDTLYUV420 (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_CLMDTSC4TSC6_Pos        (0UL)                     /*!< CLMDTSC4TSC6 (Bit 0)                                  */
#define DC_COLMOD_CLMDTSC4TSC6_Msk        (0x1UL)                   /*!< CLMDTSC4TSC6 (Bitfield-Mask: 0x01)                    */
/* ==========================================================  CRC  ========================================================== */
#define DC_CRC_CRCREG_Pos                 (0UL)                     /*!< CRCREG (Bit 0)                                        */
#define DC_CRC_CRCREG_Msk                 (0xffffffffUL)            /*!< CRCREG (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  GLLUT  ========================================================= */
#define DC_GLLUT_GLLUT0GAMRAMPR_Pos       (16UL)                    /*!< GLLUT0GAMRAMPR (Bit 16)                               */
#define DC_GLLUT_GLLUT0GAMRAMPR_Msk       (0xff0000UL)              /*!< GLLUT0GAMRAMPR (Bitfield-Mask: 0xff)                  */
#define DC_GLLUT_GLLUT0GAMRAMPG_Pos       (8UL)                     /*!< GLLUT0GAMRAMPG (Bit 8)                                */
#define DC_GLLUT_GLLUT0GAMRAMPG_Msk       (0xff00UL)                /*!< GLLUT0GAMRAMPG (Bitfield-Mask: 0xff)                  */
#define DC_GLLUT_GLLUT0GAMRAMPB_Pos       (0UL)                     /*!< GLLUT0GAMRAMPB (Bit 0)                                */
#define DC_GLLUT_GLLUT0GAMRAMPB_Msk       (0xffUL)                  /*!< GLLUT0GAMRAMPB (Bitfield-Mask: 0xff)                  */
/* ======================================================  CURSORDATA  ======================================================= */
