zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
/* ==============================================  AUDADC INTSTAT ZXCA [8..8]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_ZXCA                                                       */
  AUDADC_INTSTAT_ZXCA_ZXCAINT          = 1,     /*!< ZXCAINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
  AUDADC_INTSTAT_ZXCA_NONZXCAINT       = 0,     /*!< NONZXCAINT : Non Zero Crossing                                            */
} AUDADC_INTSTAT_ZXCA_Enum;

/* ==============================================  AUDADC INTSTAT DERR [7..7]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_DERR                                                       */
  AUDADC_INTSTAT_DERR_DMAERROR         = 1,     /*!< DMAERROR : DMA Error Condition Occurred                                   */
  AUDADC_INTSTAT_DERR_NODMAERROR       = 0,     /*!< NODMAERROR : DMA Error Condition did not Occurred                         */
} AUDADC_INTSTAT_DERR_Enum;

/* ==============================================  AUDADC INTSTAT DCMP [6..6]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_DCMP                                                       */
  AUDADC_INTSTAT_DCMP_DMACOMPLETE      = 1,     /*!< DMACOMPLETE : DMA Completed a transfer                                    */
  AUDADC_INTSTAT_DCMP_DMAON            = 0,     /*!< DMAON : DMA completion is pending or not triggered.                       */
} AUDADC_INTSTAT_DCMP_Enum;

/* ==============================================  AUDADC INTSTAT WCINC [5..5]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_WCINC                                                      */
  AUDADC_INTSTAT_WCINC_WCINCINT        = 1,     /*!< WCINCINT : Window comparator voltage incursion interrupt.                 */
  AUDADC_INTSTAT_WCINC_WCINCNOINT      = 0,     /*!< WCINCNOINT : Not a Window comparator voltage incursion interrupt.         */
} AUDADC_INTSTAT_WCINC_Enum;

/* ==============================================  AUDADC INTSTAT WCEXC [4..4]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_WCEXC                                                      */
  AUDADC_INTSTAT_WCEXC_WCEXCINT        = 1,     /*!< WCEXCINT : Window comparator voltage excursion interrupt.                 */
  AUDADC_INTSTAT_WCEXC_WCEXCNOINT      = 0,     /*!< WCEXCNOINT : Not a Window comparator voltage excursion interrupt.         */
} AUDADC_INTSTAT_WCEXC_Enum;

/* ============================================  AUDADC INTSTAT FIFOOVR2 [3..3]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSTAT_FIFOOVR2                                                   */
  AUDADC_INTSTAT_FIFOOVR2_FIFOFULLINT  = 1,     /*!< FIFOFULLINT : FIFO 100 percent full interrupt.                            */
  AUDADC_INTSTAT_FIFOOVR2_FIFOFULLNOINT = 0,    /*!< FIFOFULLNOINT : Not a FIFO 100 percent full interrupt.                    */
} AUDADC_INTSTAT_FIFOOVR2_Enum;

/* ============================================  AUDADC INTSTAT FIFOOVR1 [2..2]  ============================================= */
typedef enum {                                  /*!< AUDADC_INTSTAT_FIFOOVR1                                                   */
  AUDADC_INTSTAT_FIFOOVR1_FIFO75INT    = 1,     /*!< FIFO75INT : FIFO 75 percent full interrupt.                               */
  AUDADC_INTSTAT_FIFOOVR1_FIFO75NOINT  = 0,     /*!< FIFO75NOINT : Not FIFO 75 percent full interrupt.                         */
} AUDADC_INTSTAT_FIFOOVR1_Enum;

/* =============================================  AUDADC INTSTAT SCNCMP [1..1]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_SCNCMP                                                     */
  AUDADC_INTSTAT_SCNCMP_SCNCMPINT      = 1,     /*!< SCNCMPINT : AUDADC scan complete interrupt.                               */
  AUDADC_INTSTAT_SCNCMP_SCNCMPNOINT    = 0,     /*!< SCNCMPNOINT : No AUDADC scan complete interrupt.                          */
} AUDADC_INTSTAT_SCNCMP_Enum;

/* =============================================  AUDADC INTSTAT CNVCMP [0..0]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSTAT_CNVCMP                                                     */
  AUDADC_INTSTAT_CNVCMP_CNVCMPINT      = 1,     /*!< CNVCMPINT : AUDADC conversion complete interrupt.                         */
  AUDADC_INTSTAT_CNVCMP_CNVCMPNOINT    = 0,     /*!< CNVCMPNOINT : No AUDADC conversion complete interrupt.                    */
} AUDADC_INTSTAT_CNVCMP_Enum;

/* ========================================================  INTCLR  ========================================================= */
/* =============================================  AUDADC INTCLR SATCB [11..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_SATCB                                                       */
  AUDADC_INTCLR_SATCB_SATCBINT         = 1,     /*!< SATCBINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
  AUDADC_INTCLR_SATCB_NONSATCBINT      = 0,     /*!< NONSATCBINT : No-Saturation                                               */
} AUDADC_INTCLR_SATCB_Enum;

/* =============================================  AUDADC INTCLR SATCA [10..10]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_SATCA                                                       */
  AUDADC_INTCLR_SATCA_SATCAINT         = 1,     /*!< SATCAINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
  AUDADC_INTCLR_SATCA_NONSATCAINT      = 0,     /*!< NONSATCAINT : No Saturation                                               */
} AUDADC_INTCLR_SATCA_Enum;

/* ===============================================  AUDADC INTCLR ZXCB [9..9]  =============================================== */
typedef enum {                                  /*!< AUDADC_INTCLR_ZXCB                                                        */
  AUDADC_INTCLR_ZXCB_ZXCBINT           = 1,     /*!< ZXCBINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
  AUDADC_INTCLR_ZXCB_NONZXCBINT        = 0,     /*!< NONZXCBINT : Non Zero Crossing                                            */
} AUDADC_INTCLR_ZXCB_Enum;

