zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
/* ============================================  CLKGEN HFADJ HFWARMUP [20..20]  ============================================= */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFWARMUP                                                     */
  CLKGEN_HFADJ_HFWARMUP_1SEC           = 0,     /*!< 1SEC : Autoadjust XT warmup period = 1-2 seconds                          */
  CLKGEN_HFADJ_HFWARMUP_2SEC           = 1,     /*!< 2SEC : Autoadjust XT warmup period = 2-4 seconds                          */
} CLKGEN_HFADJ_HFWARMUP_Enum;

/* ==============================================  CLKGEN HFADJ HFADJCK [1..3]  ============================================== */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJCK                                                      */
  CLKGEN_HFADJ_HFADJCK_4SEC            = 0,     /*!< 4SEC : Autoadjust repeat period = 4 seconds                               */
  CLKGEN_HFADJ_HFADJCK_16SEC           = 1,     /*!< 16SEC : Autoadjust repeat period = 16 seconds                             */
  CLKGEN_HFADJ_HFADJCK_32SEC           = 2,     /*!< 32SEC : Autoadjust repeat period = 32 seconds                             */
  CLKGEN_HFADJ_HFADJCK_64SEC           = 3,     /*!< 64SEC : Autoadjust repeat period = 64 seconds                             */
  CLKGEN_HFADJ_HFADJCK_128SEC          = 4,     /*!< 128SEC : Autoadjust repeat period = 128 seconds                           */
  CLKGEN_HFADJ_HFADJCK_256SEC          = 5,     /*!< 256SEC : Autoadjust repeat period = 256 seconds                           */
  CLKGEN_HFADJ_HFADJCK_512SEC          = 6,     /*!< 512SEC : Autoadjust repeat period = 512 seconds                           */
  CLKGEN_HFADJ_HFADJCK_1024SEC         = 7,     /*!< 1024SEC : Autoadjust repeat period = 1024 seconds                         */
} CLKGEN_HFADJ_HFADJCK_Enum;

/* ==============================================  CLKGEN HFADJ HFADJEN [0..0]  ============================================== */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJEN                                                      */
  CLKGEN_HFADJ_HFADJEN_DIS             = 0,     /*!< DIS : Disable the HFRC adjustment                                         */
  CLKGEN_HFADJ_HFADJEN_EN              = 1,     /*!< EN : Enable the HFRC adjustment                                           */
} CLKGEN_HFADJ_HFADJEN_Enum;

/* ======================================================  CLOCKENSTAT  ====================================================== */
/* ========================================  CLKGEN CLOCKENSTAT CLOCKENSTAT [0..31]  ========================================= */
typedef enum {                                  /*!< CLKGEN_CLOCKENSTAT_CLOCKENSTAT                                            */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_PERIPH_ALL_XTAL_EN = 16777216,/*!< PERIPH_ALL_XTAL_EN : [24] Clock enable for PERIPH_ALL_XTAL_EN */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_PERIPH_ALL_HFRC_EN = 33554432,/*!< PERIPH_ALL_HFRC_EN : [25] Clock enable for PERIPH_ALL_HFRC_EN */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_HFADJEN = 67108864,/*!< HFADJEN : [26] HFRC Adjust enabled                                    */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_HFRC_EN_HFADJ = 134217728,/*!< HFRC_EN_HFADJ : [27] HFRC HFADJ enabled                        */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_nOSEL = 268435456,/*!< nOSEL : [28] ~OSEL                                                     */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_clkout_xtal_en = 536870912,/*!< clkout_xtal_en : [29] XTAL clkout enabled                     */
  CLKGEN_CLOCKENSTAT_CLOCKENSTAT_clkout_hfrc_en = 1073741824,/*!< clkout_hfrc_en : [30] HFRC clkout enabled                    */
} CLKGEN_CLOCKENSTAT_CLOCKENSTAT_Enum;

/* =====================================================  CLOCKEN2STAT  ====================================================== */
/* =======================================  CLKGEN CLOCKEN2STAT CLOCKEN2STAT [0..31]  ======================================== */
typedef enum {                                  /*!< CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT                                          */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_ADC_CLKEN = 0x1,/*!< ADC_CLKEN : [0x00] Clock enable for the ADC.                                */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_ACTIVITY_CLKEN = 0x2,/*!< APBDMA_ACTIVITY_CLKEN : [0x01] Clock enable for the APBDMA ACTIVITY */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_AOH_CLKEN = 0x4,/*!< APBDMA_AOH_CLKEN : [0x02] Clock enable for the APBDMA AOH DOMAIN     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_AOL_CLKEN = 0x8,/*!< APBDMA_AOL_CLKEN : [0x03] Clock enable for the APBDMA AOL DOMAIN     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_APB_CLKEN = 0x10,/*!< APBDMA_APB_CLKEN : [0x04] Clock enable for the APBDMA_APB           */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_AUD_CLKEN = 0x20,/*!< APBDMA_AUD_CLKEN : [0x05] Clock enable for the APBDMA_AUD           */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_CRYPTO_CLKEN = 0x40,/*!< APBDMA_CRYPTO_CLKEN : [0x06] Clock enable for the APBDMA_HCPA    */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_DBG_CLKEN = 0x80,/*!< APBDMA_DBG_CLKEN : [0x07] Clock enable for the APBDMA_DBG          */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_DISP_CLKEN = 0x100,/*!< APBDMA_DISP_CLKEN : [0x08] Clock enable for the APBDMA_DISP       */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_DISPPHY_CLKEN = 0x200,/*!< APBDMA_DISPPHY_CLKEN : [0x09] Clock enable for the APBDMA_DISPPHY */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_DSPA_CLKEN = 0x400,/*!< APBDMA_DSPA_CLKEN : [0x0a] Clock enable for the APBDMA_DSPA     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_GFX_CLKEN = 0x800,/*!< APBDMA_GFX_CLKEN : [0x0b] Clock enable for the APBDMA_GFX        */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_HSPA_CLKEN = 0x1000,/*!< APBDMA_HSPA_CLKEN : [0x0c] Clock enable for the APBDMA_HSPA     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_HSPB_CLKEN = 0x2000,/*!< APBDMA_HSPB_CLKEN : [0x0d] Clock enable for the APBDMA_HSPB     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_HSPC_CLKEN = 0x4000,/*!< APBDMA_HSPC_CLKEN : [0x0e] Clock enable for the APBDMA_HSPC    */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_IOS_CLKEN = 0x8000,/*!< APBDMA_IOS_CLKEN : [0x0f] Clock enable for the APBDMA_IOS       */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_MSPI0_CLKEN = 0x10000,/*!< APBDMA_MSPI0_CLKEN : [0x10] Clock enable for the APBDMA_MSPI0 */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_MSPI1_CLKEN = 0x20000,/*!< APBDMA_MSPI1_CLKEN : [0x11] Clock enable for the APBDMA_MSPI1 */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_MSPI2_CLKEN = 0x40000,/*!< APBDMA_MSPI2_CLKEN : [0x12] Clock enable for the APBDMA_MSPI2 */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_SDIO_CLKEN = 0x80000,/*!< APBDMA_SDIO_CLKEN : [0x13] Clock enable for the APBDMA_SDIO   */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_APBDMA_USB_CLKEN = 0x100000,/*!< APBDMA_USB_CLKEN : [0x14] Clock enable for the APBDMA_USB     */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_AUDADC_CLKEN = 0x200000,/*!< AUDADC_CLKEN : [0x15] Clock enable for the AUDADC                 */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_CM4_TPIU_CLKEN = 0x400000,/*!< CM4_TPIU_CLKEN : [0x16] Clock enable for the CM4_TPIU           */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DBG_TPIU_CLKEN = 0x800000,/*!< DBG_TPIU_CLKEN : [0x17] Clock enable for the DBG_TPIU           */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DBG_TS_CLKEN = 0x1000000,/*!< DBG_TS_CLKEN : [0x18] Clock enable for the DBG_TS                */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DISP_CLK_CLKEN = 0x2000000,/*!< DISP_CLK_CLKEN : [0x19] Clock enable for the DISP_CLK          */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DPHY_PLL_REF_CLKEN = 0x4000000,/*!< DPHY_PLL_REF_CLKEN : [0x1a] Clock enable for the DPHY_PLL_REF */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_I2S0_CLKEN = 0x8000000,/*!< DSP_I2S0_CLKEN : [0x1b] Clock enable for the DSP_I2S0         */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_I2S0_REFCLK_CLKEN = 0x10000000,/*!< DSP_I2S0_REFCLK_CLKEN : [0x1c] Clock enable for the DSP_I2S0_REFCLK */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_I2S1_CLKEN = 0x20000000,/*!< DSP_I2S1_CLKEN : [0x1d] Clock enable for the DSP_I2S1         */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_I2S1_REFCLK_CLKEN = 0x40000000,/*!< DSP_I2S1_REFCLK_CLKEN : [30] Clock enable for the DSP_I2S1_REFCLK */
  CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_DSP_MILLI_CLKEN = 0x80000000,/*!< DSP_MILLI_CLKEN : [31] Clock enable for the DSP_MILLI    */
} CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_Enum;

/* =====================================================  CLOCKEN3STAT  ====================================================== */
/* =======================================  CLKGEN CLOCKEN3STAT CLOCKEN3STAT [0..31]  ======================================== */
typedef enum {                                  /*!< CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT                                          */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_DSP_PDM0_CLKEN = 1,/*!< DSP_PDM0_CLKEN : [0] Clock enable for the DSP_PDM0                  */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_DSP_PDM1_CLKEN = 2,/*!< DSP_PDM1_CLKEN : [1] Clock enable for the DSP_PDM1                  */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_DSP_PDM2_CLKEN = 4,/*!< DSP_PDM2_CLKEN : [2] Clock enable for the DSP_PDM2                  */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_DSP_PDM3_CLKEN = 8,/*!< DSP_PDM3_CLKEN : [3] Clock enable for the DSP_PDM3                  */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_RESERVED16 = 16,/*!< RESERVED16 : Reserved selection. Operation unknown if selected.        */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_RESERVED32 = 32,/*!< RESERVED32 : Reserved selection. Operation unknown if selected.        */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC0_CLKEN = 64,/*!< IOMSTRIFC0_CLKEN : [6] Clock enable for the IOMSTRIFC0           */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC1_CLKEN = 128,/*!< IOMSTRIFC1_CLKEN : [7] Clock enable for the IO MASTER 1 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC2_CLKEN = 256,/*!< IOMSTRIFC2_CLKEN : [8] Clock enable for the IO MASTER 2 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC3_CLKEN = 512,/*!< IOMSTRIFC3_CLKEN : [9] Clock enable for the IO MASTER 3 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC4_CLKEN = 1024,/*!< IOMSTRIFC4_CLKEN : [10] Clock enable for the IO MASTER 4 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC5_CLKEN = 2048,/*!< IOMSTRIFC5_CLKEN : [11] Clock enable for the IO MASTER 5 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC6_CLKEN = 4096,/*!< IOMSTRIFC6_CLKEN : [12] Clock enable for the IO MASTER 6 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_IOMSTRIFC7_CLKEN = 8192,/*!< IOMSTRIFC7_CLKEN : [13] Clock enable for the IO MASTER 7 IFC
                                                     INTERFACE                                                                 */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_RSTGEN_CLKEN = 16384,/*!< RSTGEN_CLKEN : [14] Clock enable for the RSTGEN                   */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_RSTGEN_POS_CLKEN = 32768,/*!< RSTGEN_POS_CLKEN : [15] Clock enable for the RSTGEN           */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_RTC_CLKEN = 65536,/*!< RTC_CLKEN : [16] Clock enable for the RTC                            */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_SDIO_XIN_CLKEN = 131072,/*!< SDIO_XIN_CLKEN : [17] Clock enable for the SDIO_XIN            */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_UART0HF_CLKEN = 262144,/*!< UART0HF_CLKEN : [18] Clock enable for the UART0 HF              */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_UART1HF_CLKEN = 524288,/*!< UART1HF_CLKEN : [19] Clock enable for the UART1 HF              */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_UART2HF_CLKEN = 1048576,/*!< UART2HF_CLKEN : [20] Clock enable for the UART2 HF             */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_UART3HF_CLKEN = 2097152,/*!< UART3HF_CLKEN : [21] Clock enable for the UART3 HF             */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_USB_REFCLK_CLKEN = 4194304,/*!< USB_REFCLK_CLKEN : [22] Clock enable for the USB_REFCLK     */
  CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_WDT_CLKEN = 8388608,/*!< WDT_CLKEN : [23] Clock enable for the WDT                          */
} CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_Enum;

/* =========================================================  MISC  ========================================================== */
/* =========================================  CLKGEN MISC HFRC96TRUNKGATE [24..24]  ========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_HFRC96TRUNKGATE                                               */
  CLKGEN_MISC_HFRC96TRUNKGATE_DIS      = 0,     /*!< DIS : Disable HFRC96_TRUNK_GATE                                           */
  CLKGEN_MISC_HFRC96TRUNKGATE_EN       = 1,     /*!< EN : DO NOT USE. HFRC96_TRUNK_GATE. Setting this bit when BIT23=0,
                                                     will kill HFRC root clock.                                                */
} CLKGEN_MISC_HFRC96TRUNKGATE_Enum;

/* ========================================  CLKGEN MISC HFRCFUNCCLKGATEEN [23..23]  ========================================= */
typedef enum {                                  /*!< CLKGEN_MISC_HFRCFUNCCLKGATEEN                                             */
  CLKGEN_MISC_HFRCFUNCCLKGATEEN_DIS    = 0,     /*!< DIS : Disable clock gate                                                  */
  CLKGEN_MISC_HFRCFUNCCLKGATEEN_EN     = 1,     /*!< EN : Enable clock gate                                                    */
} CLKGEN_MISC_HFRCFUNCCLKGATEEN_Enum;

/* =======================================  CLKGEN MISC ETMTRACECLKCLKGATEEN [22..22]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MISC_ETMTRACECLKCLKGATEEN                                          */
  CLKGEN_MISC_ETMTRACECLKCLKGATEEN_DIS = 0,     /*!< DIS : Disable clock gate                                                  */
  CLKGEN_MISC_ETMTRACECLKCLKGATEEN_EN  = 1,     /*!< EN : Enable clock gate                                                    */
} CLKGEN_MISC_ETMTRACECLKCLKGATEEN_Enum;

/* ======================================  CLKGEN MISC APBDMACPUCLKCLKGATEEN [21..21]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MISC_APBDMACPUCLKCLKGATEEN                                         */
  CLKGEN_MISC_APBDMACPUCLKCLKGATEEN_DIS = 0,    /*!< DIS : Disable clock gate                                                  */
  CLKGEN_MISC_APBDMACPUCLKCLKGATEEN_EN = 1,     /*!< EN : Enable clock gate                                                    */
} CLKGEN_MISC_APBDMACPUCLKCLKGATEEN_Enum;

/* ========================================  CLKGEN MISC GFXAXICLKCLKGATEEN [20..20]  ======================================== */
typedef enum {                                  /*!< CLKGEN_MISC_GFXAXICLKCLKGATEEN                                            */
  CLKGEN_MISC_GFXAXICLKCLKGATEEN_DIS   = 0,     /*!< DIS : Disable clock gate                                                  */
  CLKGEN_MISC_GFXAXICLKCLKGATEEN_EN    = 1,     /*!< EN : Enable clock gate                                                    */
} CLKGEN_MISC_GFXAXICLKCLKGATEEN_Enum;

/* =========================================  CLKGEN MISC GFXCLKCLKGATEEN [19..19]  ========================================== */
typedef enum {                                  /*!< CLKGEN_MISC_GFXCLKCLKGATEEN                                               */
  CLKGEN_MISC_GFXCLKCLKGATEEN_DIS      = 0,     /*!< DIS : Disable clock gate                                                  */
  CLKGEN_MISC_GFXCLKCLKGATEEN_EN       = 1,     /*!< EN : Enable clock gate                                                    */
} CLKGEN_MISC_GFXCLKCLKGATEEN_Enum;

/* =========================================  CLKGEN MISC CM4DAXICLKGATEEN [18..18]  ========================================= */
typedef enum {                                  /*!< CLKGEN_MISC_CM4DAXICLKGATEEN                                              */
  CLKGEN_MISC_CM4DAXICLKGATEEN_DIS     = 0,     /*!< DIS : Disable clock gate                                                  */
  CLKGEN_MISC_CM4DAXICLKGATEEN_EN      = 1,     /*!< EN : Enable clock gate                                                    */
} CLKGEN_MISC_CM4DAXICLKGATEEN_Enum;

/* =======================================  CLKGEN MISC PWRONCLKENUSBREFCLK [17..17]  ======================================== */
typedef enum {                                  /*!< CLKGEN_MISC_PWRONCLKENUSBREFCLK                                           */
  CLKGEN_MISC_PWRONCLKENUSBREFCLK_USBREFCLKENRST = 0,/*!< USBREFCLKENRST : Enable USB REF Clock to run during reset            */
  CLKGEN_MISC_PWRONCLKENUSBREFCLK_DEFEATURE = 1,/*!< DEFEATURE : Chicken bit to revert to rev A                                */
} CLKGEN_MISC_PWRONCLKENUSBREFCLK_Enum;

