zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
/* =======================================================  CACHECFG  ======================================================== */
/* ==============================================  CPU CACHECFG CONFIG [4..7]  =============================================== */
typedef enum {                                  /*!< CPU_CACHECFG_CONFIG                                                       */
  CPU_CACHECFG_CONFIG_W1_128B_512E     = 4,     /*!< W1_128B_512E : Direct mapped, 128-bit linesize, 512 entries
                                                     (4 SRAMs active)                                                          */
  CPU_CACHECFG_CONFIG_W2_128B_512E     = 5,     /*!< W2_128B_512E : Two-way set associative, 128-bit linesize, 512
                                                     entries (8 SRAMs active)                                                  */
  CPU_CACHECFG_CONFIG_W1_128B_1024E    = 8,     /*!< W1_128B_1024E : Direct mapped, 128-bit linesize, 1024 entries
                                                     (8 SRAMs active)                                                          */
  CPU_CACHECFG_CONFIG_W1_128B_2048E    = 12,    /*!< W1_128B_2048E : Direct mapped, 128-bit linesize, 2048 entries
                                                     (4 SRAMs active)                                                          */
  CPU_CACHECFG_CONFIG_W2_128B_2048E    = 13,    /*!< W2_128B_2048E : Two-way set associative, 128-bit linesize, 2048
                                                     entries (8 SRAMs active)                                                  */
  CPU_CACHECFG_CONFIG_W1_128B_4096E    = 14,    /*!< W1_128B_4096E : Direct mapped, 128-bit linesize, 4096 entries
                                                     (8 SRAMs active)                                                          */
} CPU_CACHECFG_CONFIG_Enum;

/* =======================================================  CACHECTRL  ======================================================= */
/* ============================================  CPU CACHECTRL RESETSTAT [1..1]  ============================================= */
typedef enum {                                  /*!< CPU_CACHECTRL_RESETSTAT                                                   */
  CPU_CACHECTRL_RESETSTAT_CLEAR        = 1,     /*!< CLEAR : Clear Cache Stats                                                 */
  CPU_CACHECTRL_RESETSTAT_DEFAULT      = 0,     /*!< DEFAULT : default Cache Stats                                             */
} CPU_CACHECTRL_RESETSTAT_Enum;

/* =======================================================  NCR0START  ======================================================= */
/* ========================================================  NCR0END  ======================================================== */
/* =======================================================  NCR1START  ======================================================= */
/* ========================================================  NCR1END  ======================================================== */
/* ========================================================  DAXICFG  ======================================================== */
/* ==========================================  CPU DAXICFG MRUGROUPLEVEL [24..25]  =========================================== */
typedef enum {                                  /*!< CPU_DAXICFG_MRUGROUPLEVEL                                                 */
  CPU_DAXICFG_MRUGROUPLEVEL_MAX        = 0,     /*!< MAX : Maximum level for current number of buffers enabled.                */
  CPU_DAXICFG_MRUGROUPLEVEL_ONELESSTHANMAX = 1, /*!< ONELESSTHANMAX : One less than maximum level or zero for current
                                                     number of buffers enabled.                                                */
  CPU_DAXICFG_MRUGROUPLEVEL_TWOLESSTHANMAX = 2, /*!< TWOLESSTHANMAX : Two less than maximum level or zero for current
                                                     number of buffers enabled.                                                */
  CPU_DAXICFG_MRUGROUPLEVEL_THREELESSTHANMAX = 3,/*!< THREELESSTHANMAX : Three less than maximum level or zero for
                                                     current number of buffers enabled.                                        */
} CPU_DAXICFG_MRUGROUPLEVEL_Enum;

/* ===========================================  CPU DAXICFG AGINGCOUNTER [16..20]  =========================================== */
typedef enum {                                  /*!< CPU_DAXICFG_AGINGCOUNTER                                                  */
  CPU_DAXICFG_AGINGCOUNTER_ONE         = 0,     /*!< ONE : One step per age                                                    */
  CPU_DAXICFG_AGINGCOUNTER_TWO         = 1,     /*!< TWO : Two steps per age                                                   */
  CPU_DAXICFG_AGINGCOUNTER_FOUR        = 2,     /*!< FOUR : Four steps per age                                                 */
  CPU_DAXICFG_AGINGCOUNTER_EIGHT       = 3,     /*!< EIGHT : EIGHT steps per age                                               */
  CPU_DAXICFG_AGINGCOUNTER_SIXTEEN     = 4,     /*!< SIXTEEN : Sixteen steps per age                                           */
  CPU_DAXICFG_AGINGCOUNTER_THIRTYTWO   = 5,     /*!< THIRTYTWO : Thirty-two steps per age                                      */
  CPU_DAXICFG_AGINGCOUNTER_SIXTYFOUR   = 6,     /*!< SIXTYFOUR : 64 steps per age                                              */
  CPU_DAXICFG_AGINGCOUNTER_ONEHUNDREDTWENTYEIGHT = 7,/*!< ONEHUNDREDTWENTYEIGHT : One hundred twenty-eight steps per age       */
  CPU_DAXICFG_AGINGCOUNTER_TWOHUNDEREDFIFTYSIX = 8,/*!< TWOHUNDEREDFIFTYSIX : Two hundred fifty-six steps per age              */
  CPU_DAXICFG_AGINGCOUNTER_FIVEHUNDREDTWELVE = 9,/*!< FIVEHUNDREDTWELVE : Five hundred twelve steps per age                    */
  CPU_DAXICFG_AGINGCOUNTER_ONEK        = 10,    /*!< ONEK : One thousand twenty-four steps per age                             */
  CPU_DAXICFG_AGINGCOUNTER_TWOK        = 11,    /*!< TWOK : Two thousand forty-eight steps per age                             */
  CPU_DAXICFG_AGINGCOUNTER_FOURK       = 12,    /*!< FOURK : Four thousand ninety-six steps per age                            */
  CPU_DAXICFG_AGINGCOUNTER_EIGHTK      = 13,    /*!< EIGHTK : Eight thousand one hundred ninety-two steps per age              */
  CPU_DAXICFG_AGINGCOUNTER_SIXTEENK    = 14,    /*!< SIXTEENK : Sixteen thousand three hundred eighty-four steps
                                                     per age                                                                   */
  CPU_DAXICFG_AGINGCOUNTER_THIRTYTWOK  = 15,    /*!< THIRTYTWOK : Thirty-two thousand seven hundred sixty-eight steps
                                                     per age                                                                   */
  CPU_DAXICFG_AGINGCOUNTER_SIXTYFOURK  = 16,    /*!< SIXTYFOURK : Sixty-fix thousand five hundred thirty-six steps
                                                     per age                                                                   */
} CPU_DAXICFG_AGINGCOUNTER_Enum;

/* ===========================================  CPU DAXICFG BUFFERENABLE [8..11]  ============================================ */
typedef enum {                                  /*!< CPU_DAXICFG_BUFFERENABLE                                                  */
  CPU_DAXICFG_BUFFERENABLE_ONE         = 0,     /*!< ONE : One buffer mode enabled.                                            */
  CPU_DAXICFG_BUFFERENABLE_TWO         = 1,     /*!< TWO : Two buffers enabled.                                                */
  CPU_DAXICFG_BUFFERENABLE_THREE       = 2,     /*!< THREE : Three buffers enabled.                                            */
  CPU_DAXICFG_BUFFERENABLE_FOUR        = 3,     /*!< FOUR : Four buffers enabled.                                              */
  CPU_DAXICFG_BUFFERENABLE_FIVE        = 4,     /*!< FIVE : Five buffers enabled.                                              */
  CPU_DAXICFG_BUFFERENABLE_SIX         = 5,     /*!< SIX : Six buffers enabled.                                                */
  CPU_DAXICFG_BUFFERENABLE_SEVEN       = 6,     /*!< SEVEN : Seven buffers enabled.                                            */
  CPU_DAXICFG_BUFFERENABLE_EIGHT       = 7,     /*!< EIGHT : Eight buffers enabled.                                            */
  CPU_DAXICFG_BUFFERENABLE_THIRTEEN    = 8,     /*!< THIRTEEN : Eight buffers enabled.                                         */
  CPU_DAXICFG_BUFFERENABLE_FOURTEEN    = 9,     /*!< FOURTEEN : Eight buffers enabled.                                         */
  CPU_DAXICFG_BUFFERENABLE_FIFTEEN     = 10,    /*!< FIFTEEN : Eight buffers enabled.                                          */
  CPU_DAXICFG_BUFFERENABLE_SIXTEEN     = 11,    /*!< SIXTEEN : Eight buffers enabled.                                          */
  CPU_DAXICFG_BUFFERENABLE_TWENTYNINE  = 12,    /*!< TWENTYNINE : Twenty-nine buffers enabled.                                 */
  CPU_DAXICFG_BUFFERENABLE_THIRTY      = 13,    /*!< THIRTY : Thirty buffers enabled.                                          */
  CPU_DAXICFG_BUFFERENABLE_THIRTYONE   = 14,    /*!< THIRTYONE : Thirty-one buffers enabled.                                   */
  CPU_DAXICFG_BUFFERENABLE_THIRTYTWO   = 15,    /*!< THIRTYTWO : Thirty-two buffers enabled.                                   */
} CPU_DAXICFG_BUFFERENABLE_Enum;

/* =========================================  CPU DAXICFG DAXISTATECLKGATEEN [5..5]  ========================================= */
typedef enum {                                  /*!< CPU_DAXICFG_DAXISTATECLKGATEEN                                            */
  CPU_DAXICFG_DAXISTATECLKGATEEN_EN    = 0,     /*!< EN : Enable clock gating of DAXI state.                                   */
  CPU_DAXICFG_DAXISTATECLKGATEEN_DIS   = 1,     /*!< DIS : Disable clock gating of DAXI state.                                 */
} CPU_DAXICFG_DAXISTATECLKGATEEN_Enum;

/* =========================================  CPU DAXICFG DAXIDATACLKGATEEN [4..4]  ========================================== */
typedef enum {                                  /*!< CPU_DAXICFG_DAXIDATACLKGATEEN                                             */
  CPU_DAXICFG_DAXIDATACLKGATEEN_EN     = 0,     /*!< EN : Enable clock gating of DAXI line buffer data.                        */
  CPU_DAXICFG_DAXIDATACLKGATEEN_DIS    = 1,     /*!< DIS : Disable clock gating of DAXI line buffer data.                      */
} CPU_DAXICFG_DAXIDATACLKGATEEN_Enum;

