zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
/* ==========================================  CPU DAXICFG DAXIBECLKGATEEN [3..3]  =========================================== */
typedef enum {                                  /*!< CPU_DAXICFG_DAXIBECLKGATEEN                                               */
  CPU_DAXICFG_DAXIBECLKGATEEN_EN       = 0,     /*!< EN : Enable clock gating of DAXI line buffer byte enables.                */
  CPU_DAXICFG_DAXIBECLKGATEEN_DIS      = 1,     /*!< DIS : Disable clock gating of DAXI line buffer byte enables.              */
} CPU_DAXICFG_DAXIBECLKGATEEN_Enum;

/* ==========================================  CPU DAXICFG DAXIPASSTHROUGH [2..2]  =========================================== */
typedef enum {                                  /*!< CPU_DAXICFG_DAXIPASSTHROUGH                                               */
  CPU_DAXICFG_DAXIPASSTHROUGH_DIS      = 0,     /*!< DIS : Disable pass through mode, caching lines in DAXI enabled.           */
  CPU_DAXICFG_DAXIPASSTHROUGH_EN       = 1,     /*!< EN : Enable pass through mode, caching lines in DAXI disabled.            */
} CPU_DAXICFG_DAXIPASSTHROUGH_Enum;

/* ============================================  CPU DAXICFG AGINGSENABLE [1..1]  ============================================ */
typedef enum {                                  /*!< CPU_DAXICFG_AGINGSENABLE                                                  */
  CPU_DAXICFG_AGINGSENABLE_DIS         = 0,     /*!< DIS : Flushing out shared entries using aging mechanism disabled.         */
  CPU_DAXICFG_AGINGSENABLE_EN          = 1,     /*!< EN : Flushing out shared entries using aging mechanism enabled.           */
} CPU_DAXICFG_AGINGSENABLE_Enum;

/* =============================================  CPU DAXICFG FLUSHLEVEL [0..0]  ============================================= */
typedef enum {                                  /*!< CPU_DAXICFG_FLUSHLEVEL                                                    */
  CPU_DAXICFG_FLUSHLEVEL_TWO           = 0,     /*!< TWO : Flush out dirty buffers if 3 or more ane enabled and less
                                                     than two are free or if 2 are enabled and none are free.                  */
  CPU_DAXICFG_FLUSHLEVEL_THREE         = 1,     /*!< THREE : Flush out dirty buffers if 3 or more are enabled less
                                                     than three are free or if 2 are enabled and less then two
                                                     are free.                                                                 */
} CPU_DAXICFG_FLUSHLEVEL_Enum;

/* =======================================================  DAXICTRL  ======================================================== */
/* ====================================================  ICODEFAULTADDR  ===================================================== */
/* ====================================================  DCODEFAULTADDR  ===================================================== */
/* =====================================================  SYSFAULTADDR  ====================================================== */
/* ======================================================  FAULTSTATUS  ====================================================== */
/* ============================================  CPU FAULTSTATUS SYSFAULT [2..2]  ============================================ */
typedef enum {                                  /*!< CPU_FAULTSTATUS_SYSFAULT                                                  */
  CPU_FAULTSTATUS_SYSFAULT_NOFAULT     = 0,     /*!< NOFAULT : No bus fault has been detected.                                 */
  CPU_FAULTSTATUS_SYSFAULT_FAULT       = 1,     /*!< FAULT : Bus fault detected.                                               */
} CPU_FAULTSTATUS_SYSFAULT_Enum;

/* ===========================================  CPU FAULTSTATUS DCODEFAULT [1..1]  =========================================== */
typedef enum {                                  /*!< CPU_FAULTSTATUS_DCODEFAULT                                                */
  CPU_FAULTSTATUS_DCODEFAULT_NOFAULT   = 0,     /*!< NOFAULT : No DCODE fault has been detected.                               */
  CPU_FAULTSTATUS_DCODEFAULT_FAULT     = 1,     /*!< FAULT : DCODE fault detected.                                             */
} CPU_FAULTSTATUS_DCODEFAULT_Enum;

/* ===========================================  CPU FAULTSTATUS ICODEFAULT [0..0]  =========================================== */
typedef enum {                                  /*!< CPU_FAULTSTATUS_ICODEFAULT                                                */
  CPU_FAULTSTATUS_ICODEFAULT_NOFAULT   = 0,     /*!< NOFAULT : No ICODE fault has been detected.                               */
  CPU_FAULTSTATUS_ICODEFAULT_FAULT     = 1,     /*!< FAULT : ICODE fault detected.                                             */
} CPU_FAULTSTATUS_ICODEFAULT_Enum;

/* ====================================================  FAULTCAPTUREEN  ===================================================== */
/* =======================================  CPU FAULTCAPTUREEN FAULTCAPTUREEN [0..0]  ======================================== */
typedef enum {                                  /*!< CPU_FAULTCAPTUREEN_FAULTCAPTUREEN                                         */
  CPU_FAULTCAPTUREEN_FAULTCAPTUREEN_DIS = 0,    /*!< DIS : Disable fault capture.                                              */
  CPU_FAULTCAPTUREEN_FAULTCAPTUREEN_EN = 1,     /*!< EN : Enable fault capture.                                                */
} CPU_FAULTCAPTUREEN_FAULTCAPTUREEN_Enum;

/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* =====================================================  WRITEERRADDR  ====================================================== */
/* =========================================================  DMON0  ========================================================= */
/* =========================================================  DMON1  ========================================================= */
/* =========================================================  DMON2  ========================================================= */
/* =========================================================  DMON3  ========================================================= */
/* =========================================================  IMON0  ========================================================= */
/* =========================================================  IMON1  ========================================================= */
/* =========================================================  IMON2  ========================================================= */
/* =========================================================  IMON3  ========================================================= */


/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */

