zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
/* ===============================================  IOSLAVE CFG IFCSEL [0..0]  =============================================== */
typedef enum {                                  /*!< IOSLAVE_CFG_IFCSEL                                                        */
  IOSLAVE_CFG_IFCSEL_I2C               = 0,     /*!< I2C : Selects I2C interface for the IO Slave.                             */
  IOSLAVE_CFG_IFCSEL_SPI               = 1,     /*!< SPI : Selects SPI interface for the IO Slave.                             */
} IOSLAVE_CFG_IFCSEL_Enum;

/* =========================================================  PRENC  ========================================================= */
/* =======================================================  IOINTCTL  ======================================================== */
/* ========================================================  GENADD  ========================================================= */
/* ========================================================  ADDPTR  ========================================================= */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ======================================================  REGACCINTEN  ====================================================== */
/* =====================================================  REGACCINTSTAT  ===================================================== */
/* =====================================================  REGACCINTCLR  ====================================================== */
/* =====================================================  REGACCINTSET  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          MCUCTRL                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CHIPPN  ========================================================= */
/* ==============================================  MCUCTRL CHIPPN PN [24..31]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_PN                                                         */
  MCUCTRL_CHIPPN_PN_APOLLO4L           = 9,     /*!< APOLLO4L : Apollo4L part number is 0x09xxxxxx.                            */
  MCUCTRL_CHIPPN_PN_APOLLO4            = 8,     /*!< APOLLO4 : Apollo4 part number is 0x08xxxxxx.                              */
  MCUCTRL_CHIPPN_PN_APOLLO3P           = 7,     /*!< APOLLO3P : Apollo3P part number is 0x07xxxxxx.                            */
  MCUCTRL_CHIPPN_PN_APOLLO3            = 6,     /*!< APOLLO3 : Apollo3 part number is 0x06xxxxxx.                              */
  MCUCTRL_CHIPPN_PN_APOLLO2            = 3,     /*!< APOLLO2 : Apollo2 part number is 0x03xxxxxx.                              */
  MCUCTRL_CHIPPN_PN_APOLLO             = 1,     /*!< APOLLO : Apollo part number is 0x01xxxxxx.                                */
} MCUCTRL_CHIPPN_PN_Enum;

/* ===========================================  MCUCTRL CHIPPN MRAMSIZE [20..23]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_MRAMSIZE                                                   */
  MCUCTRL_CHIPPN_MRAMSIZE_0P5MB        = 0,     /*!< 0P5MB : MRAM size is 0.5MB                                                */
  MCUCTRL_CHIPPN_MRAMSIZE_1P0MB        = 1,     /*!< 1P0MB : MRAM size is 1.0MB                                                */
  MCUCTRL_CHIPPN_MRAMSIZE_1P5MB        = 2,     /*!< 1P5MB : MRAM size is 1.5MB                                                */
  MCUCTRL_CHIPPN_MRAMSIZE_2P0MB        = 3,     /*!< 2P0MB : MRAM size is 2.0MB                                                */
} MCUCTRL_CHIPPN_MRAMSIZE_Enum;

/* ===========================================  MCUCTRL CHIPPN SRAMSIZE [16..19]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_SRAMSIZE                                                   */
  MCUCTRL_CHIPPN_SRAMSIZE_384_512      = 0,     /*!< 384_512 : SRAM size is 384KB+512KB                                        */
  MCUCTRL_CHIPPN_SRAMSIZE_384_1024     = 1,     /*!< 384_1024 : SRAM size is 384KB+1MB                                         */
  MCUCTRL_CHIPPN_SRAMSIZE_384_1024_384_96 = 2,  /*!< 384_1024_384_96 : SRAM size is 384KB+1MB+384KB+96KB                       */
} MCUCTRL_CHIPPN_SRAMSIZE_Enum;

/* ============================================  MCUCTRL CHIPPN REVMAJ [12..15]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_REVMAJ                                                     */
  MCUCTRL_CHIPPN_REVMAJ_A              = 0,     /*!< A : Major Rev A                                                           */
  MCUCTRL_CHIPPN_REVMAJ_B              = 1,     /*!< B : Major Rev B                                                           */
  MCUCTRL_CHIPPN_REVMAJ_C              = 2,     /*!< C : Major Rev C                                                           */
} MCUCTRL_CHIPPN_REVMAJ_Enum;

/* =============================================  MCUCTRL CHIPPN REVMIN [8..11]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_REVMIN                                                     */
  MCUCTRL_CHIPPN_REVMIN_0              = 0,     /*!< 0 : Minor Rev 0                                                           */
  MCUCTRL_CHIPPN_REVMIN_1              = 1,     /*!< 1 : Minor Rev 1                                                           */
} MCUCTRL_CHIPPN_REVMIN_Enum;

/* ===============================================  MCUCTRL CHIPPN PKG [6..7]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_PKG                                                        */
  MCUCTRL_CHIPPN_PKG_SIP               = 0,     /*!< SIP : SIP package.                                                        */
  MCUCTRL_CHIPPN_PKG_SIP2              = 1,     /*!< SIP2 : SIP2 package.                                                      */
  MCUCTRL_CHIPPN_PKG_BGA               = 2,     /*!< BGA : BGA package.                                                        */
  MCUCTRL_CHIPPN_PKG_CSP               = 3,     /*!< CSP : CSP package.                                                        */
} MCUCTRL_CHIPPN_PKG_Enum;

/* ==============================================  MCUCTRL CHIPPN PINS [3..5]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_PINS                                                       */
  MCUCTRL_CHIPPN_PINS_25               = 0,     /*!< 25 : 25 pins                                                              */
  MCUCTRL_CHIPPN_PINS_49               = 1,     /*!< 49 : 49 pins                                                              */
  MCUCTRL_CHIPPN_PINS_64               = 2,     /*!< 64 : 64 pins                                                              */
  MCUCTRL_CHIPPN_PINS_81               = 3,     /*!< 81 : 81 pins                                                              */
} MCUCTRL_CHIPPN_PINS_Enum;

/* ==============================================  MCUCTRL CHIPPN TEMP [1..2]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_TEMP                                                       */
  MCUCTRL_CHIPPN_TEMP_COM              = 0,     /*!< COM : Commercial temperature                                              */
  MCUCTRL_CHIPPN_TEMP_MIL              = 1,     /*!< MIL : Military temperature                                                */
  MCUCTRL_CHIPPN_TEMP_AUTO             = 2,     /*!< AUTO : Automotive temperature                                             */
  MCUCTRL_CHIPPN_TEMP_IND              = 3,     /*!< IND : Industrial temperature                                              */
} MCUCTRL_CHIPPN_TEMP_Enum;

