zephyrproject-rtos/hal_ambiq/CMSIS/AmbiqMicro/Include/apollo4p.h
/* =======================================================  EMONCFG4  ======================================================== */
/* ===========================================  PWRCTRL EMONCFG4 EMONSEL4 [0..7]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_EMONCFG4_EMONSEL4                                                 */
  PWRCTRL_EMONCFG4_EMONSEL4_NEVER      = 0,     /*!< NEVER : Never increment the counter                                       */
  PWRCTRL_EMONCFG4_EMONSEL4_ALWAYS     = 1,     /*!< ALWAYS : Always increment the counter                                     */
  PWRCTRL_EMONCFG4_EMONSEL4_MCUSLEEP   = 2,     /*!< MCUSLEEP : Increment the counter for MCU sleep mode                       */
  PWRCTRL_EMONCFG4_EMONSEL4_MCUDEEPSLEEP = 3,   /*!< MCUDEEPSLEEP : Increment the counter for MCU deepsleep mode               */
  PWRCTRL_EMONCFG4_EMONSEL4_DSP0ON     = 4,     /*!< DSP0ON : Increment the counter for DSP0 active mode                       */
  PWRCTRL_EMONCFG4_EMONSEL4_DSP1ON     = 5,     /*!< DSP1ON : Increment the counter for DSP1 active mode                       */
  PWRCTRL_EMONCFG4_EMONSEL4_ADCON      = 6,     /*!< ADCON : Increment the counter when ADC is powered on                      */
  PWRCTRL_EMONCFG4_EMONSEL4_AUDPBON    = 7,     /*!< AUDPBON : Increment the counter when AUDPB is powered on                  */
  PWRCTRL_EMONCFG4_EMONSEL4_AUDRECON   = 8,     /*!< AUDRECON : Increment the counter when AUDREC is powered on                */
  PWRCTRL_EMONCFG4_EMONSEL4_I2S0ON     = 9,     /*!< I2S0ON : Increment the counter when I2S0 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_I2S1ON     = 10,    /*!< I2S1ON : Increment the counter when I2S1 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_PDM0ON     = 11,    /*!< PDM0ON : Increment the counter when PDM0 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_PDM1ON     = 12,    /*!< PDM1ON : Increment the counter when PDM1 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_PDM2ON     = 13,    /*!< PDM2ON : Increment the counter when PDM2 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_PDM3ON     = 14,    /*!< PDM3ON : Increment the counter when PDM3 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_AUDADCON   = 15,    /*!< AUDADCON : Increment the counter when AUDADC is powered on                */
  PWRCTRL_EMONCFG4_EMONSEL4_CRYPTOON   = 16,    /*!< CRYPTOON : Increment the counter when CRYPTO is powered on                */
  PWRCTRL_EMONCFG4_EMONSEL4_DBGON      = 17,    /*!< DBGON : Increment the counter when DBG is powered on                      */
  PWRCTRL_EMONCFG4_EMONSEL4_DISPON     = 18,    /*!< DISPON : Increment the counter when DISP is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_DISPPHYON  = 19,    /*!< DISPPHYON : Increment the counter when DISPPHY is powered on              */
  PWRCTRL_EMONCFG4_EMONSEL4_DSPAON     = 20,    /*!< DSPAON : Increment the counter when DSPA is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_GFXON      = 21,    /*!< GFXON : Increment the counter when GFX is powered on                      */
  PWRCTRL_EMONCFG4_EMONSEL4_UART0ON    = 22,    /*!< UART0ON : Increment the counter when UART0 is powered on                  */
  PWRCTRL_EMONCFG4_EMONSEL4_UART1ON    = 23,    /*!< UART1ON : Increment the counter when UART1 is powered on                  */
  PWRCTRL_EMONCFG4_EMONSEL4_UART2ON    = 24,    /*!< UART2ON : Increment the counter when UART2 is powered on                  */
  PWRCTRL_EMONCFG4_EMONSEL4_UART3ON    = 25,    /*!< UART3ON : Increment the counter when UART3 is powered on                  */
  PWRCTRL_EMONCFG4_EMONSEL4_IOM0ON     = 26,    /*!< IOM0ON : Increment the counter when IOM0 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_IOM1ON     = 27,    /*!< IOM1ON : Increment the counter when IOM1 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_IOM2ON     = 28,    /*!< IOM2ON : Increment the counter when IOM2 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_IOM3ON     = 29,    /*!< IOM3ON : Increment the counter when IOM3 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_RESERVED30 = 30,    /*!< RESERVED30 : Reserved selection. Operation unknown if selected.           */
  PWRCTRL_EMONCFG4_EMONSEL4_RESERVED31 = 31,    /*!< RESERVED31 : Reserved selection. Operation unknown if selected.           */
  PWRCTRL_EMONCFG4_EMONSEL4_IOM4ON     = 32,    /*!< IOM4ON : Increment the counter when IOM4 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_IOM5ON     = 33,    /*!< IOM5ON : Increment the counter when IOM5 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_IOM6ON     = 34,    /*!< IOM6ON : Increment the counter when IOM6 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_IOM7ON     = 35,    /*!< IOM7ON : Increment the counter when IOM7 is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_IOSON      = 36,    /*!< IOSON : Increment the counter when IOS is powered on                      */
  PWRCTRL_EMONCFG4_EMONSEL4_MSPI0ON    = 37,    /*!< MSPI0ON : Increment the counter when MSPI0 is powered on                  */
  PWRCTRL_EMONCFG4_EMONSEL4_MSPI1ON    = 38,    /*!< MSPI1ON : Increment the counter when MSPI1 is powered on                  */
  PWRCTRL_EMONCFG4_EMONSEL4_MSPI2ON    = 39,    /*!< MSPI2ON : Increment the counter when MSPI2 is powered on                  */
  PWRCTRL_EMONCFG4_EMONSEL4_SDIOON     = 40,    /*!< SDIOON : Increment the counter when SDIO is powered on                    */
  PWRCTRL_EMONCFG4_EMONSEL4_USBON      = 41,    /*!< USBON : Increment the counter when USB is powered on                      */
  PWRCTRL_EMONCFG4_EMONSEL4_USBPHYON   = 42,    /*!< USBPHYON : Increment the counter when USBPHY is powered on                */
} PWRCTRL_EMONCFG4_EMONSEL4_Enum;

